{
  "navbarHome": "Home",
  "navbarExpertise": "Expertise",
  "navbarProjects": "Projects",
  "navbarExperience": "Experience",
  "navbarEducation": "Education",
  "navbarContactMe": "Contact Me",
  
  "titleExpertise": "Expertise",
  "titleProjects": "Projects",
  "titleExperience": "Experience",
  "titleEducation": "Education",
  "titleContactMe": "Contact Me",
  
  "expertiseSoftwareDevelopmentTitle": "Software Development",
  "expertiseBackendTitle": "Backend",
  "expertiseFrontendTitle": "Frontend",
  "expertiseDatabaseTitle": "Database",
  "expertiseToolsTitle": "Tools",
  "expertiseVersionControlTitle": "Version Control",
  "expertiseSourceCodeTitle": "Source Code",
  "expertiseWebsiteTitle": "Website",
  "expertiseMessageBusTitle": "Message Bus",
  "expertiseContainerTitle": "Container",
  "expertiseTitleTechnologies": "Technologies",
  "expertiseDescriptionSoftwareDevelopment": "Seasoned in .NET with <1>6+ years</1> crafting scalable solutions, adept in <3>OOP</3>, <5>SOLID principles</5>, and best coding practices.",
  "expertiseDescriptionBackend": "Expert in <1>.NET</1> with a strong focus on robust, scalable backends, complemented by proficiency in <3>Django</3> and <5>Spring Boot</5>.",
  "expertiseDescriptionFrontend": "Skilled in <1>React</1>, <3>Next.js</3>, and <5>TypeScript</5> creating responsive, user-focused interfaces that seamlessly integrate with dynamic backends.",
  "expertiseDescriptionDatabase": "Proficient with <1>SQL Server</1>, <3>PostgreSQL</3>, <5>MongoDB</5>, optimizing data storage and retrieval for high-performance, scalable applications.",

  "projectTitleCarAuction": "Car Auction",
  "projectDescriptionCarAuction": "Carsties Auctions offers an online platform for car auctions with microservices architecture, enabling listings, bidding, and auction management in a user-friendly interface.",
  "projectTitleECommerce": "E-Commerce",
  "projectDescriptionECommerce": "The e-commerce application is a scalable, backend-focused online shopping platform for product auctioning, featuring clean architecture for efficient maintenance.",
  "projectTitleRideShare": "RideShare - (Startup)",
  "projectDescriptionRideShare": "The RideShare app is a backend-driven platform, utilizing SOLID principles and n-tier architecture, to automatically connect applicants with drivers, including payment functionality.",
  "projectTitleELearning": "E-Learning",
  "projectDescriptionELearning": "The Online Learning app offers a platform where users can purchase packages to access and complete online tutorials and courses, earning certifications upon completion.",
  "projectTitleUserActivity": "User's Activity",
  "projectDescriptionUserActivity": "The Activity Application is a .NET Core and React-based platform for creating, sharing, and joining activities, featuring user interaction and participation management.",
  "projectTitleCinemaTicket": "Cinema Ticket",
  "projectDescriptionCinemaTicket": "Cinema Ticket is a full-stack web application using React and ASP.NET Core, enabling users to buy tickets and administrators to manage listings and sales.",
  "projectTitleMahsaDance": "Mahsa Dance",
  "projectDescriptionMahsaDance": "Mahsa Dance offers an online platform for secure and interactive dance course delivery, utilizing .NET Core, NextJs, and SQL Server.",


  "projectCarAuctionIntro": "Introduction to Carsties Auctions",
  "projectCarAuctionIntroDescription": "The <1>Carsties Auctions</1> platform is an innovative online car auction system that transforms the dynamics of vehicle trading. With a focus on creating a seamless, efficient, and transparent buying and selling experience, the project is rooted in a <3>microservices architecture</3>. This approach harnesses a variety of advanced technologies and methodologies to ensure the platform's scalability, performance, and user satisfaction.",
  "projectCarAuctionFeatures": "Core Features and User Experience",
  "projectCarAuctionFeaturesDescription": "Designed from the ground up, Carsties Auctions aims to streamline the car auction process. Users have the capability to list vehicles, engage in real-time bidding, and effortlessly manage their auctions. Essential features include <1>secure user authentication</1> and authorization, <3>comprehensive auction management</3>, <5>real-time bidding</5> mechanics, and <7>advanced auction listings and filters</7>. The platform also emphasizes keeping users informed with <9>instant notifications</9> on auction updates, fostering an engaged and informed community.",
  "projectCarAuctionArchitecture": "Architectural Overview",
  "projectCarAuctionArchitectureDescription": "The <1>architecture</1> of Carsties Auctions is a testament to modern <2>software engineering</2>, comprising multiple <3>microservices</3> each dedicated to a specific function - <4>Auction Service</4>, <5>Bidding Service</5>, <6>Identity Service</6>, <7>Notification Service</7>, <8>Search Service</8>, and <9>Gateway Service</9>. This modular design significantly enhances the application's <10>maintainability</10>, <11>scalability</11>, and facilitates <12>agile development</12> and <13>deployment</13> processes.",
  "projectCarAuctionTechnological": "Technological Stack",
  "projectCarAuctionTechnologicalDescription": "On the technological front, the project leverages <1>React</1> and <2>Next.js</2> to craft a dynamic and responsive frontend experience. The backend architecture is powered by <3>.NET 7</3>, with <4>Entity Framework Core</4> for ORM, <5>MassTransit</5> coupled with <6>RabbitMQ</6> for efficient messaging, and <7>gRPC</7> for seamless inter-service communication. Data storage solutions include <8>PostgreSQL</8> and <9>MongoDB</9>, addressing both structured and bid management data needs. The entire infrastructure is containerized using <10>Docker</10>, with <11>Docker Compose</11> handling orchestration to simplify deployment and scaling operations.",
  "projectCarAuctionImpact": "Project Impact and Personal Contributions",
  "projectCarAuctionImpactDescription": "This project not only showcases the application of cutting-edge technologies in real-world scenarios but also highlights my comprehensive skill set in <1>architecting</1>, <2>developing</2>, and <3>deploying</3> complex web applications. My contributions spanned across all phases of the project - from initial design and <4>architecture</4> to <5>development</5>, and <6>deployment</6>, ensuring a robust, scalable, and user-centric platform. Through Carsties Auctions, I have demonstrated an adeptness in navigating the complexities of <7>software engineering</7>, pushing the boundaries of traditional web applications, and delivering a product that stands as a benchmark for quality and innovation in the online car auction space.",

  "projectCinemaTicketTitle": "Cinema Ticket",
  "projectCinemaTicketIntro": "Introduction to Cinema Ticket",
  "projectCinemaTicketIntroDescription": "The <1>Cinema Ticket</1> project is a full-stack web application designed to enhance the movie-going experience for cinema enthusiasts. It allows users to browse and purchase cinema tickets for upcoming movies seamlessly, while administrators can manage showtimes, movie listings, and ticket sales efficiently. Built using <2>React</2> for the frontend and <3>ASP.NET Core</3> for the backend, the application ensures a responsive, scalable, and secure platform for all users.",
  "projectCinemaTicketFeatures": "Core Features",
  "projectCinemaTicketFeaturesDescription": "Cinema Ticket boasts a range of features including a <1>user-friendly interface</1> for easy navigation, a <2>comprehensive movie catalog</2> with detailed pages for each movie, <3>basket functionality</3> for ticket selections, and <4>secure user authentication</4> for user management. Additionally, the platform offers <5>admin management tools</5> for movie and showtime management, enhancing the overall administrative workflow.",
  "projectCinemaTicketTechnology": "Technology Stack",
  "projectCinemaTicketTechnologyDescription": "The frontend is developed with <1>React</1> using <2>TypeScript</2>, and styled with <3>Material UI</3>. The backend is powered by <4>ASP.NET Core</4>, utilizing <5>Entity Framework Core</5> for data access and <6>SQL Server</6> for the database. <7>Stripe</7> is integrated for secure payment processing, with <8>Docker</8> supporting containerization and deployment, and <9>GitHub Actions</9> for CI/CD pipelines.",
  "projectCinemaTicketDevelopment": "Development and Deployment",
  "projectCinemaTicketDevelopmentDescription": "Emphasizing clean code and best practices, the development process included thorough testing to ensure a bug-free and user-friendly platform. The application's design allows for easy deployment and scalability, catering to a growing audience of movie enthusiasts.",
  "projectCinemaTicketPersonalContributions": "Personal Contributions",
  "projectCinemaTicketPersonalContributionsDescription": "My contributions to the Cinema Ticket project spanned across the full development lifecycle, from designing the database schema and implementing backend services to developing the React frontend and integrating payment processing. This project refined my full-stack development skills and deepened my understanding of creating scalable, user-centric web applications.",

  "projectECommerceIntro": "Introduction to E-Commerce Application",
  "projectECommerceIntroDescription": "The <1>E-Commerce Application</1> is a groundbreaking e-commerce platform specialized in auctioning products, designed with a focus on efficiency, scalability, and providing an engaging user experience. This backend-centric application serves as a testament to the effective use of modern <3>software engineering</3> principles, offering both administrators and users a comprehensive suite of features to facilitate the auction process.",
  "projectECommerceFeatures": "Key Features and User Experience",
  "projectECommerceFeaturesDescription": "Central to the platform's offering are its <1>product and category management</1> features, enabling administrators to maintain an up-to-date inventory. Users benefit from a sophisticated <3>shopping cart</3> system and <5>secure payment processing</5>, integrated with leading services like Stripe. The application enhances engagement through <7>real-time notifications</7>, utilizing Twilio for email and SMS communication, keeping users informed about auction updates and outcomes.",
  "projectECommerceArchitecture": "Architectural Overview",
  "projectECommerceArchitectureDescription": "At its core, the E-Commerce Application adopts a <1>clean architecture</1>, segregating the system into distinct layers that ensure separation of concerns and facilitate scalability. This backend architecture is meticulously crafted using <3>.NET Core</3>, providing a robust foundation for building RESTful APIs that serve as the backbone of the application.",
  "projectECommerceTechnology": "Technological Stack",
  "projectECommerceTechnologyDescription": "The technological prowess of the E-Commerce Application is evident in its use of <1>SQL Server</1> and <3>Redis</3> for data storage and caching, respectively. This choice ensures high performance and reliability. Security and user management are adeptly handled through <5>ASP.NET Identity</5>, while payment transactions are securely processed with the <7>Stripe API</7>. Furthermore, the application leverages <9>Twilio</9> for comprehensive notification services, ensuring a seamless and interactive user experience.",
  "projectECommerceImpact": "Project Impact and Personal Contributions",
  "projectECommerceImpactDescription": "My involvement in the E-Commerce Application spanned across all developmental stages, from conceptualization and design to implementation and deployment. My efforts were instrumental in architecting the backend infrastructure, integrating payment and notification services, and ensuring the application's scalability and security. This project stands as a showcase of my ability to leverage <1>modern development practices</1> and <3>technology stacks</3> to deliver a comprehensive and robust e-commerce solution.",

  "projectELearningIntro": "Introduction to E-Learning",
  "projectELearningIntroDescription": "The <1>E-Learning</1> platform is an innovative online education platform, developed using the <3>Django framework</3>. It serves as a virtual classroom where instructors can create and manage courses, upload educational content, and interact with students. Simultaneously, students can enroll in courses, access learning materials, and track their progress, making it a comprehensive solution for remote education.",
  "projectELearningFeatures": "Key Features and Functionalities",
  "projectELearningFeaturesDescription": "At the heart of the E-Learning are its core features, designed to enhance the online learning experience. These include <1>dynamic course creation and management</1> by instructors, <3>student enrollment</3> in courses, <5>integrated payment processing</5> for course fees, and a <7>content delivery system</7> that supports various file types. Additionally, the application facilitates <9>interactive student assessments</9> and progress tracking, thereby fostering a productive learning environment.",
  "projectELearningTechnology": "Technological Stack",
  "projectELearningTechnologyDescription": "The application's backend is developed with <1>Django</1>, leveraging its powerful ORM for database interactions and its secure authentication mechanisms for user management. The frontend integrates seamlessly with Django templates, enhanced with <3>Bootstrap</3> for responsive design. For data storage, the app uses <5>SQLite</5> for development and supports <7>Djongo</7> for MongoDB integration, offering flexibility in handling structured and unstructured data. Payment processing is implemented via <9>Stripe</9>, ensuring secure transactions within the platform.",
  "projectELearningDevelopment": "Development and Deployment",
  "projectELearningDevelopmentDescription": "Development practices for E-Learning emphasized modularity, security, and scalability. Django's built-in security features were rigorously applied to safeguard user data and interactions. The application's design facilitates easy deployment and scaling, catering to a growing user base. Testing was conducted extensively to ensure reliability and performance under various scenarios.",
  "projectELearningPersonalContributions": "Personal Contributions and Learning Outcomes",
  "projectELearningPersonalContributionsDescription": "My role in developing E-Learning spanned from conceptualization to deployment, including designing the database schema, implementing backend logic, and crafting the user interface. This project honed my skills in full-stack development, particularly in <1>Django</1> and web application security. It underscored the importance of thoughtful design and testing in creating effective educational tools.",


  "projectRideShareOverview": "Comprehensive Overview of Revaal",
  "projectRideShareOverviewDescription": "The inception of <1>Revaal</1> was driven by the ambition to redefine the conventional rideshare landscape. This project was meticulously crafted using <3>.NET Core</3> for the backend and <5>React</5> for the frontend, embodying the pinnacle of modern web application development. It was conceived to address the gaping need for a reliable, efficient, and user-centric platform that simplifies the process of sharing rides, with an emphasis on security, scalability, and a seamless user experience.",
  "projectRideShareFeatures": "Innovative Feature Set",
  "projectRideShareFeaturesDescription": "At the heart of Revaal lies its innovative feature set, designed from the ground up to cater to both drivers and passengers. The system's <1>dynamic ride matching algorithm</1> not only prioritizes geographical proximity but also factors in user preferences and ratings, ensuring a match that is both convenient and safe. The <3>real-time ride tracking</3> feature empowers users with information at their fingertips, enhancing trust and reliability. Meanwhile, the <5>integrated payment system</5>, bolstered by Stripe's robust infrastructure, offers a wide array of payment options, ensuring transactions are smooth and secure.",
  "projectRideShareTechnology": "Deep Dive into Technology",
  "projectRideShareTechnologyDescription": "The architectural backbone of Revaal is its <1>microservices architecture</1>, enabling modular development, ease of maintenance, and scalability. The backend's reliance on <3>ASP.NET Core</3> is a testament to our commitment to performance and security, while the frontend use of <5>React and TypeScript</5> ensures a dynamic and responsive user experience. Our database choice, <7>SQL Server</7>, alongside <9>MongoDB</9> for document-oriented needs, reflects our dedication to robust data management and flexibility.",
  "projectRideShareSecurity": "Addressing Security and Privacy",
  "projectRideShareSecurityDescription": "Security and privacy stand as the pillars of the Revaal platform. Implementing <1>JWT</1> for authentication and adhering to <3>OAuth 2.0</3> standards for third-party integrations, we've established a secure environment that users can trust. Our comprehensive security measures ensure that every transaction and user interaction is conducted with the highest regard for privacy and data protection.",
  "projectRideShareChallenges": "Overcoming Development Hurdles",
  "projectRideShareChallengesDescription": "The journey of developing Revaal was marked by numerous technical and design challenges. Achieving seamless communication across microservices required a sophisticated <1>API gateway</1> solution, while ensuring data consistency across distributed services necessitated innovative approaches like <3>event sourcing</3> and <5>CQRS patterns</5>. Tackling the dynamic nature of the frontend presented its own set of challenges, met through advanced state management techniques and a component-driven architecture.",
  "projectRideShareReflections": "Reflections on Personal Contributions",
  "projectRideShareReflectionsDescription": "My involvement in Revaal spanned the entirety of its lifecycle, from conceptual design to deployment. Leading the architectural design, I navigated the complexities of integrating multiple services into a cohesive system. My work on the frontend introduced innovative features that enhanced user interactions, while backend development focused on creating scalable, secure services. This project was a profound learning journey, deepening my expertise in full-stack development and reinforcing the importance of user-centric design in creating impactful digital solutions.",



  "projectUserActivityIntro": "Introduction to Activity Application",
  "projectUserActivityIntroDescription": "The <1>Activity Application</1> emerges as a vibrant community platform, enabling users to create, share, and join a wide array of activities. Built upon the robust foundations of <3>.NET Core</3> and <5>React</5>, this application stands as a testament to modern web development practices, offering an engaging and interactive user experience.",
  "projectUserActivityFeatures": "Core Features",
  "projectUserActivityFeaturesDescription": "Key features of the Activity Application include <1>user authentication</1>, allowing secure login and registration; <3>activity management</3>, where users can create, update, and delete activities; <5>comments</5>, supporting user interaction on activities; and <7>image upload</7>, enabling users to share images related to activities. The application also leverages <9>SignalR</9> for real-time updates, enhancing the dynamism of user participation and interaction.",
  "projectUserActivityTechnology": "Technology Stack",
  "projectUserActivityTechnologyDescription": "At the technological core, the frontend is developed with <1>React</1> and <3>TypeScript</3>, employing <5>MobX</5> for state management to ensure a responsive and state-of-the-art user interface. The backend is powered by <7>.NET 5.0</7>, with <9>Entity Framework Core</9> managing database operations and <11>JWT</11> for authentication, ensuring a secure and scalable application architecture. <13>SQLite</13> is utilized for development databases, with provisions for easy migration to <15>SQL Server</15> or <17>PostgreSQL</17>. Additionally, <19>Cloudinary</19> integration facilitates robust image hosting solutions.",
  "projectUserActivityDevelopment": "Development Insights",
  "projectUserActivityDevelopmentDescription": "The development journey of the Activity Application emphasized clean code practices, modular architecture, and the implementation of real-time data exchange to foster a lively community engagement. Rigorous testing phases ensured a bug-free and user-friendly platform, ready to scale and adapt to the evolving needs of its user base.",
  "projectUserActivityPersonal": "Personal Contributions",
  "projectUserActivityPersonalDescription": "My role in this project spanned from initial concept design, through development, to final deployment. I was pivotal in integrating <1>SignalR</1> for real-time communication, crafting the <3>React</3> frontend components, and establishing a secure <5>.NET Core</5> backend. This project refined my skills in full-stack development, particularly in creating applications that require immediate data updates and user interactions.",


  "projectMahsaDanceIntro": "Introduction to Mahsa Dance",
  "projectMahsaDanceIntroDescription": "Mahsa Dance is a specialized online platform designed for a dance tutor to deliver dance courses to students globally. Utilizing advanced technologies like <1>.NET Core</1>, <3>NextJs</3>, and <5>SQL Server</5>, the platform integrates e-commerce with educational tools to enrich both the tutor and student experiences.",
  "projectMahsaDanceFeatures": "Core Features",
  "projectMahsaDanceFeaturesDescription": "Key features include a <1>shop section</1> for selecting and purchasing courses, secured by robust payment gateways. A distinctive video delivery system protects course content via a secure proxy, preventing unauthorized sharing. Additionally, customizable discounts and promotional offers enhance user engagement and sales.",
  "projectMahsaDanceTechnology": "Technology Stack",
  "projectMahsaDanceTechnologyDescription": "The platform's frontend uses <1>NextJs</1> and <3>TypeScript</3>, styled with <5>Tailwind CSS</5> and <7>SCSS</7> for a responsive and modern user interface. The backend, powered by <9>.NET Core</9> and managed by <11>SQL Server</11>, integrates <13>Cloudflare CDN</13> for optimized global content delivery.",
  "projectMahsaDanceDevelopment": "Security and Data Handling",
  "projectMahsaDanceDevelopmentDescription": "A sophisticated caching and proxy mechanism for video streaming reduces redundancy and load times, enhancing content security and delivery efficiency. Videos are securely downloaded and cached for subsequent accesses, ensuring efficient and secure data flow.",
  "projectMahsaDancePersonal": "Personal Contributions",
  "projectMahsaDancePersonalDescription": "Throughout the project's lifecycle, I led the design and implementation of core features, including the secure video streaming proxy, the integration of <1>Cloudflare CDN</1>, and the development of the responsive frontend with <3>NextJs</3> and <5>Tailwind CSS</5>. This role refined my skills in full-stack development and secure platform design.",





  "experienceCedarValleyDateFrom": "Sep 2023",
  "experienceCedarValleyDateTo": "Jan 2024",
  "experienceCedarValleyDescription": "At Cedar Valley, I spearheaded the digital transformation of manual, paper-based processes into sophisticated digital systems as a Backend Developer, leveraging .NET Core and C# for developing robust backend systems. My contributions range from enhancing ingredient and logistics tracking to implementing RabbitMQ for message queuing and occasionally supporting the frontend with React.js, all underpinned by Microsoft SQL Server. This work has been crucial in reducing manual labor, errors, and enhancing operational efficiency and accountability.",
  "experienceCedarValleyCountry": "Canada, Windsor",
  "experienceCedarValleyPosition": "In-site",
  "experienceCedarValleyRole": "Backend Developer",

  "experienceOrispotDateFrom": "Apr 2023",
  "experienceOrispotDateTo": "Present",
  "experienceOrispotDescription": "In my role as a Full Stack Developer, I navigate the complexities of both backend and frontend development, leveraging .NET Core for backend solutions and ReactJS for creating engaging user interfaces. My expertise encompasses Object-Oriented Programming, Object-Relational Mapping, and rigorous testing practices to ensure high-quality software delivery. From architecting scalable backend functionalities with .NET Core to designing intuitive, responsive interfaces with ReactJS, my work is dedicated to enhancing user experience and application performance through modular code and comprehensive testing strategies.",
  "experienceOrispotCountry": "Australia, Sydney",
  "experienceOrispotPosition": "Remote",
  "experienceOrispotRole": "Fullstack Developer",

  "experienceParisaShafaqDateFrom": "Apr 2017",
  "experienceParisaShafaqDateTo": "Mar 2022",
  "experienceParisaShafaqDescription": "At Parisa Shafaq, I significantly enhanced my expertise in SQL Server integration, database design, and Windows Forms applications, alongside deepening my understanding of software development fundamentals, teamwork, code optimization, and Git version control, all contributing to my comprehensive skill set in software development and system maintenance.",
  "experienceParisaShafaqCountry": "Iran, Tehran",
  "experienceParisaShafaqPosition": "In-site",
  "experienceParisaShafaqRole": "Windows (WinForms, WPF) and Web Developer",

  "educationWindsorDateFrom": "Sep 2022",
  "educationWindsorDateTo": "Dec 2023",
  "educationWindsorDescription": "During my Master of Applied Computing (MAC), I honed advanced skills in software development, focusing on both theoretical concepts and practical applications. This program equipped me with a deep understanding of computer science principles, including algorithm design, system architecture, and data analysis. I engaged in rigorous projects that emphasized problem-solving in real-world scenarios, leveraging cutting-edge technologies. My studies culminated in a comprehensive project that demonstrated my ability to innovate and apply my knowledge to complex challenges.",
  "educationWindsorCountry": "Canada, Windsor",
  "educationWindsorPosition": "In-Person",
  "educationWindsorRole": "Master of Applied Computing (MAC) - Computer Science",

  "educationAzadUniversityDateFrom": "Sep 2015",
  "educationAzadUniversityDateTo": "Jun 2019",
  "educationAzadUniversityDescription": "In my Bachelor's degree in Software Engineering, I developed a solid foundation in the principles of engineering software systems, from design to implementation. This comprehensive program covered a wide range of topics, including software development life cycles, quality assurance, and database management. Through hands-on projects and collaborative teamwork, I acquired practical experience in developing robust, scalable, and efficient software solutions. My education emphasized not only technical proficiency but also the importance of ethical considerations and effective communication in the field of software engineering.",
  "educationAzadUniversityCountry": "Iran, Tehran",
  "educationAzadUniversityPosition": "In-Person",
  "educationAzadUniversityRole": "Software Engineering",
  
  "contactMeNameLabel": "Name",
  "contactMeEmailLabel": "Email",
  "contactMeSubjectLabel": "Subject",
  "contactMeMessageLabel": "Your Message",

  "contactMeClearButtonLabel": "Clear",
  "contactMeSendButtonLabel": "Send",
  "contactMeSendingButtonLabel": "Sending...",
  
  "footerSocialDescription": "If you're interested in collaborating on a project or require my expertise, please don't hesitate to reach out using the contact options below.",
  "footerCopyRightYear": "© 2024. Made with passion by <1>Ali Shahbazi</1>",
  "footerCopyRightText": "All rights reserved.",
  
  "footerReferenceMahdiFiroozjaei": "Ali Shahbazi was one of my students at the University of Windsor. He has passed two courses with me, namely Advanced Computing Concept and Internship Project. I know him since Sep. 2022.Ali showed himself as a talent student. I found him a hard working student by contributing and presenting a considerable project in Stock Market Analysis.I have found Ali a well organized and hardworking person and do recommend him for consideration.",
  "footerReferenceMahdiFiroozjaeiPosition": "Professor",
  "footerReferenceUsamaMir": "It gives me immense pleasure to recommend Ali Shahbazi. Ali was my student in Master of Applied Computing (MAC) program at University of Windsor (UoW). I found him to be a top student in the class. He is very attentive during his classes and asks relevant questions. He achieved good scores in my course. He has excellent written and verbal communication skills, is extremely organized, reliable, and computer literate. Therefore, I strongly recommend Ali for any related Internship and Job opportunities.",
  "footerReferenceUsamaMirPosition": "Professor",
  "footerReferenceAtefehGilvari": "Ali was an exceptional student in our advanced software engineering course. His strong problem-solving and teamwork skills make him a standout performer.",
  "footerReferenceAtefehGilvariPosition": "PhD Candidate",
  "footerReferenceArashShabbeh": "Ali is one of the most talented, hard-working, fast learners and trustworthy colleagues I've ever had. I believe cooperating with Ali on any project could undoubtedly have many benefits.",
  "footerReferenceArashShabbehPosition": "Senior .NET Developer"
}