{
  "navbarHome": "Home",
  "navbarExpertise": "Expertise",
  "navbarProjects": "Projects",
  "navbarExperience": "Experience",
  "navbarEducation": "Education",
  "navbarContactMe": "Contact Me",
  
  "titleExpertise": "Expertise",
  "titleProjects": "Projects",
  "titleExperience": "Experience",
  "titleEducation": "Education",
  "titleContactMe": "Contact Me",
  
  "expertiseSoftwareDevelopmentTitle": "Software Development",
  "expertiseBackendTitle": "Backend",
  "expertiseFrontendTitle": "Frontend",
  "expertiseDatabaseTitle": "Database",
  "expertiseTitleTechnologies": "Technologies",
  "expertiseDescriptionSoftwareDevelopment": "Seasoned in .NET with <1>6+ years</1> crafting scalable solutions, adept in <3>OOP</3>, <5>SOLID principles</5>, and best coding practices.",
  "expertiseDescriptionBackend": "Expert in <1>.NET</1> with a strong focus on robust, scalable backends, complemented by proficiency in <3>Django</3> and <5>Spring Boot</5>.",
  "expertiseDescriptionFrontend": "Skilled in <1>React</1>, <3>Next.js</3>, and <5>TypeScript</5> creating responsive, user-focused interfaces that seamlessly integrate with dynamic backends.",
  "expertiseDescriptionDatabase": "Proficient with <1>SQL Server</1>, <3>PostgreSQL</3>, <5>MongoDB</5>, optimizing data storage and retrieval for high-performance, scalable applications.",
  
  "projectTitleCarAuction": "Car Auction",
  "projectDescriptionCarAuction": "Carsties Auctions offers an online platform for car auctions with microservices architecture, enabling listings, bidding, and auction management in a user-friendly interface.",
  "projectTitleECommerce": "E-Commerce",
  "projectDescriptionECommerce": "The e-commerce application is a scalable, backend-focused online shopping platform for product auctioning, featuring clean architecture for efficient maintenance.",
  "projectTitleRideShare": "RideShare",
  "projectDescriptionRideShare": "The RideShare app is a backend-driven platform, utilizing SOLID principles and n-tier architecture, to automatically connect applicants with drivers, including payment functionality.",
  "projectTitleELearning": "E-Learning",
  "projectDescriptionELearning": "The Online Learning app offers a platform where users can purchase packages to access and complete online tutorials and courses, earning certifications upon completion.",
  "projectTitleUserActivity": "User's Activity",
  "projectDescriptionUserActivity": "The Activity Application is a .NET Core and React-based platform for creating, sharing, and joining activities, featuring user interaction and participation management.",
  "projectTitleCinemaTicket": "Cinema Ticket",
  "projectDescriptionCinemaTicket": "Cinema Ticket is a full-stack web application using React and ASP.NET Core, enabling users to buy tickets and administrators to manage listings and sales.",
  
  "projectCarAuctionIntro": "Introduction to Carsties Auctions",
  "projectCarAuctionIntroDescription": "The <1>Carsties Auctions</1> platform is an innovative online car auction system that transforms the dynamics of vehicle trading. With a focus on creating a seamless, efficient, and transparent buying and selling experience, the project is rooted in a <3>microservices architecture</3>. This approach harnesses a variety of advanced technologies and methodologies to ensure the platform's scalability, performance, and user satisfaction.",
  "projectCarAuctionFeatures": "Core Features and User Experience",
  "projectCarAuctionFeaturesDescription": "Designed from the ground up, Carsties Auctions aims to streamline the car auction process. Users have the capability to list vehicles, engage in real-time bidding, and effortlessly manage their auctions. Essential features include <1>secure user authentication</1> and authorization, <3>comprehensive auction management</3>, <5>real-time bidding</5> mechanics, and <7>advanced auction listings and filters</7>. The platform also emphasizes keeping users informed with <9>instant notifications</9> on auction updates, fostering an engaged and informed community.",
  "projectCarAuctionArchitecture": "Architectural Overview",
  "projectCarAuctionArchitectureDescription": "The <1>architecture</1> of Carsties Auctions is a testament to modern <2>software engineering</2>, comprising multiple <3>microservices</3> each dedicated to a specific function - <4>Auction Service</4>, <5>Bidding Service</5>, <6>Identity Service</6>, <7>Notification Service</7>, <8>Search Service</8>, and <9>Gateway Service</9>. This modular design significantly enhances the application's <10>maintainability</10>, <11>scalability</11>, and facilitates <12>agile development</12> and <13>deployment</13> processes.",
  "projectCarAuctionTechnological": "Technological Stack",
  "projectCarAuctionTechnologicalDescription": "On the technological front, the project leverages <1>React</1> and <2>Next.js</2> to craft a dynamic and responsive frontend experience. The backend architecture is powered by <3>.NET 7</3>, with <4>Entity Framework Core<4> for ORM, <5>MassTransit</5> coupled with <6>RabbitMQ</6> for efficient messaging, and <7>gRPC</7> for seamless inter-service communication. Data storage solutions include <8>PostgreSQL</8> and <9>MongoDB</9>, addressing both structured and bid management data needs. The entire infrastructure is containerized using <10>Docker</10>, with <11>Docker Compose</11> handling orchestration to simplify deployment and scaling operations.",
  "projectCarAuctionImpact": "Project Impact and Personal Contributions",
  "projectCarAuctionImpactDescription": "This project not only showcases the application of cutting-edge technologies in real-world scenarios but also highlights my comprehensive skill set in <1>architecting</1>, <2>developing</2>, and <3>deploying</3> complex web applications. My contributions spanned across all phases of the project - from initial design and <4>architecture</4> to <5>development</5>, and <6>deployment</6>, ensuring a robust, scalable, and user-centric platform. Through Carsties Auctions, I have demonstrated an adeptness in navigating the complexities of <7>software engineering</7>, pushing the boundaries of traditional web applications, and delivering a product that stands as a benchmark for quality and innovation in the online car auction space.",
  
  "projectCinemaTicketIntro": "Introduction to Cinema Ticket",
  "projectCinemaTicketIntroDescription": "The <1>Cinema Ticket</1> project is a full-stack web application designed to enhance the movie-going experience for cinema enthusiasts. It allows users to browse and purchase cinema tickets for upcoming movies seamlessly, while administrators can manage showtimes, movie listings, and ticket sales efficiently. Built using <2>React</2> for the frontend and <3>ASP.NET Core</3> for the backend, the application ensures a responsive, scalable, and secure platform for all users.",
  "projectCinemaTicketFeatures": "Core Features",
  "projectCinemaTicketFeaturesDescription": "Cinema Ticket boasts a range of features including a <1>user-friendly interface</1> for easy navigation, a <2>comprehensive movie catalog</2> with detailed pages for each movie, <3>basket functionality</3> for ticket selections, and <4>secure user authentication</4> for user management. Additionally, the platform offers <5>admin management tools</5> for movie and showtime management, enhancing the overall administrative workflow.",
  "projectCinemaTicketTechnology": "Technology Stack",
  "projectCinemaTicketTechnologyDescription": "The frontend is developed with <1>React</1> using <2>TypeScript</2>, and styled with <3>Material UI</3>. The backend is powered by <4>ASP.NET Core</4>, utilizing <5>Entity Framework Core</5> for data access and <6>SQL Server</6> for the database. <7>Stripe</7> is integrated for secure payment processing, with <8>Docker</8> supporting containerization and deployment, and <9>GitHub Actions</9> for CI/CD pipelines.",
  "projectCinemaTicketDevelopment": "Development and Deployment",
  "projectCinemaTicketDevelopmentDescription": "Emphasizing clean code and best practices, the development process included thorough testing to ensure a bug-free and user-friendly platform. The application's design allows for easy deployment and scalability, catering to a growing audience of movie enthusiasts.",
  "projectCinemaTicketPersonalContributions": "Personal Contributions",
  "projectCinemaTicketPersonalContributionsDescription": "My contributions to the Cinema Ticket project spanned across the full development lifecycle, from designing the database schema and implementing backend services to developing the React frontend and integrating payment processing. This project refined my full-stack development skills and deepened my understanding of creating scalable, user-centric web applications.",
  
  
  "experienceCedarValleyDateFrom": "Sep 2023",
  "experienceCedarValleyDateTo": "Jan 2024",
  "experienceCedarValleyDescription": "At Cedar Valley, I spearheaded the digital transformation of manual, paper-based processes into sophisticated digital systems as a Backend Developer, leveraging .NET Core and C# for developing robust backend systems. My contributions range from enhancing ingredient and logistics tracking to implementing RabbitMQ for message queuing and occasionally supporting the frontend with React.js, all underpinned by Microsoft SQL Server. This work has been crucial in reducing manual labor, errors, and enhancing operational efficiency and accountability.",
  "experienceCedarValleyCountry": "Canada, Windsor",
  "experienceCedarValleyPosition": "In-site",
  "experienceCedarValleyRole": "Backend Developer",

  "experienceOrispotDateFrom": "Apr 2023",
  "experienceOrispotDateTo": "Present",
  "experienceOrispotDescription": "In my role as a Full Stack Developer, I navigate the complexities of both backend and frontend development, leveraging .NET Core for backend solutions and ReactJS for creating engaging user interfaces. My expertise encompasses Object-Oriented Programming, Object-Relational Mapping, and rigorous testing practices to ensure high-quality software delivery. From architecting scalable backend functionalities with .NET Core to designing intuitive, responsive interfaces with ReactJS, my work is dedicated to enhancing user experience and application performance through modular code and comprehensive testing strategies.",
  "experienceOrispotCountry": "Australia, Sydney",
  "experienceOrispotPosition": "Remote",
  "experienceOrispotRole": "Fullstack Developer",

  "experienceParisaShafaqDateFrom": "Apr 2017",
  "experienceParisaShafaqDateTo": "Mar 2022",
  "experienceParisaShafaqDescription": "At Parisa Shafaq, I significantly enhanced my expertise in SQL Server integration, database design, and Windows Forms applications, alongside deepening my understanding of software development fundamentals, teamwork, code optimization, and Git version control, all contributing to my comprehensive skill set in software development and system maintenance.",
  "experienceParisaShafaqCountry": "Iran, Tehran",
  "experienceParisaShafaqPosition": "In-site",
  "experienceParisaShafaqRole": "Windows (WinForms, WPF) and Web Developer",

  "educationWindsorDateFrom": "Sep 2022",
  "educationWindsorDateTo": "Dec 2023",
  "educationWindsorDescription": "During my Master of Applied Computing (MAC), I honed advanced skills in software development, focusing on both theoretical concepts and practical applications. This program equipped me with a deep understanding of computer science principles, including algorithm design, system architecture, and data analysis. I engaged in rigorous projects that emphasized problem-solving in real-world scenarios, leveraging cutting-edge technologies. My studies culminated in a comprehensive project that demonstrated my ability to innovate and apply my knowledge to complex challenges.",
  "educationWindsorCountry": "Canada, Windsor",
  "educationWindsorPosition": "In-Person",
  "educationWindsorRole": "Master of Applied Computing (MAC) - Computer Science",

  "educationAzadUniversityDateFrom": "Sep 2015",
  "educationAzadUniversityDateTo": "Jun 2019",
  "educationAzadUniversityDescription": "In my Bachelor's degree in Software Engineering, I developed a solid foundation in the principles of engineering software systems, from design to implementation. This comprehensive program covered a wide range of topics, including software development life cycles, quality assurance, and database management. Through hands-on projects and collaborative teamwork, I acquired practical experience in developing robust, scalable, and efficient software solutions. My education emphasized not only technical proficiency but also the importance of ethical considerations and effective communication in the field of software engineering.",
  "educationAzadUniversityCountry": "Iran, Tehran",
  "educationAzadUniversityPosition": "In-Person",
  "educationAzadUniversityRole": "Software Engineering",
  
  "contactMeNameLabel": "Name",
  "contactMeEmailLabel": "Email",
  "contactMeSubjectLabel": "Subject",
  "contactMeMessageLabel": "Your Message",

  "contactMeClearButtonLabel": "Name",
  "contactMeSendButtonLabel": "Send",
  "contactMeSendingButtonLabel": "Sending...",
  
  "footerSocialDescription": "If you're interested in collaborating on a project or require my expertise, please don't hesitate to reach out using the contact options below.",
  "footerCopyRightYear": "© 2024. Made with passion by <1>Ali Shahbazi</1>",
  "footerCopyRightText": "All rights reserved.",
  
  "footerReferenceMahdiFiroozjaei": "Ali Shahbazi was one of my students at the University of Windsor. He has passed two courses with me, namely Advanced Computing Concept and Internship Project. I know him since Sep. 2022.Ali showed himself as a talent student. I found him a hard working student by contributing and presenting a considerable project in Stock Market Analysis.I have found Ali a well organized and hardworking person and do recommend him for consideration.",
  "footerReferenceMahdiFiroozjaeiPosition": "Professor",
  "footerReferenceUsamaMir": "It gives me immense pleasure to recommend Ali Shahbazi. Ali was my student in Master of Applied Computing (MAC) program at University of Windsor (UoW). I found him to be a top student in the class. He is very attentive during his classes and asks relevant questions. He achieved good scores in my course. He has excellent written and verbal communication skills, is extremely organized, reliable, and computer literate. Therefore, I strongly recommend Ali for any related Internship and Job opportunities.",
  "footerReferenceUsamaMirPosition": "Professor",
  "footerReferenceAtefehGilvari": "Ali was an exceptional student in our advanced software engineering course. His strong problem-solving and teamwork skills make him a standout performer.",
  "footerReferenceAtefehGilvariPosition": "PhD Candidate",
  "footerReferenceArashShabbeh": "Ali is one of the most talented, hard-working, fast learners and trustworthy colleagues I've ever had. I believe cooperating with Ali on any project could undoubtedly have many benefits.",
  "footerReferenceArashShabbehPosition": "Senior .NET Developer"
}