{
  "titleExpertise": "Expertise",
  "titleProjects": "Projects",
  "titleExperience": "Experience",
  "titleEducation": "Education",
  "titleContactMe": "Contact Me",
  
  "expertiseSoftwareDevelopmentTitle": "Software Development",
  "expertiseBackendTitle": "Backend",
  "expertiseFrontendTitle": "Frontend",
  "expertiseDatabaseTitle": "Database",
  "expertiseTitleTechnologies": "Technologies",
  "expertiseDescriptionSoftwareDevelopment": "Seasoned in .NET with <1>6+ years</1> crafting scalable solutions, adept in <3>OOP</3>, <5>SOLID principles</5>, and best coding practices.",
  "expertiseDescriptionBackend": "Expert in <1>.NET</1> with a strong focus on robust, scalable backends, complemented by proficiency in <3>Django</3> and <5>Spring Boot</5>.",
  "expertiseDescriptionFrontend": "Skilled in <1>React</1>, <3>Next.js</3>, and <5>TypeScript</5> creating responsive, user-focused interfaces that seamlessly integrate with dynamic backends.",
  "expertiseDescriptionDatabase": "Proficient with <1>SQL Server</1>, <3>PostgreSQL</3>, <5>MongoDB</5>, optimizing data storage and retrieval for high-performance, scalable applications.",
  
  "projectTitleCarAuction": "Car Auction",
  "projectDescriptionCarAuction": "Carsties Auctions offers an online platform for car auctions with microservices architecture, enabling listings, bidding, and auction management in a user-friendly interface.",
  "projectTitleECommerce": "E-Commerce",
  "projectDescriptionECommerce": "The e-commerce application is a scalable, backend-focused online shopping platform for product auctioning, featuring clean architecture for efficient maintenance.",
  "projectTitleRideShare": "RideShare",
  "projectDescriptionRideShare": "The RideShare app is a backend-driven platform, utilizing SOLID principles and n-tier architecture, to automatically connect applicants with drivers, including payment functionality.",
  "projectTitleELearning": "E-Learning",
  "projectDescriptionELearning": "The Online Learning app offers a platform where users can purchase packages to access and complete online tutorials and courses, earning certifications upon completion.",
  "projectTitleUserActivity": "User's Activity",
  "projectDescriptionUserActivity": "The Activity Application is a .NET Core and React-based platform for creating, sharing, and joining activities, featuring user interaction and participation management.",
  "projectTitleCinemaTicket": "Cinema Ticket",
  "projectDescriptionCinemaTicket": "Cinema Ticket is a full-stack web application using React and ASP.NET Core, enabling users to buy tickets and administrators to manage listings and sales.",
  
  "experienceCedarValleyDateFrom": "Sep 2023",
  "experienceCedarValleyDateTo": "Jan 2024",
  "experienceCedarValleyDescription": "At Cedar Valley, I spearheaded the digital transformation of manual, paper-based processes into sophisticated digital systems as a Backend Developer, leveraging .NET Core and C# for developing robust backend systems. My contributions range from enhancing ingredient and logistics tracking to implementing RabbitMQ for message queuing and occasionally supporting the frontend with React.js, all underpinned by Microsoft SQL Server. This work has been crucial in reducing manual labor, errors, and enhancing operational efficiency and accountability.",
  "experienceCedarValleyCountry": "Canada, Windsor",
  "experienceCedarValleyPosition": "In-site",
  "experienceCedarValleyRole": "Backend Developer",

  "experienceOrispotDateFrom": "Apr 2023",
  "experienceOrispotDateTo": "Present",
  "experienceOrispotDescription": "In my role as a Full Stack Developer, I navigate the complexities of both backend and frontend development, leveraging .NET Core for backend solutions and ReactJS for creating engaging user interfaces. My expertise encompasses Object-Oriented Programming, Object-Relational Mapping, and rigorous testing practices to ensure high-quality software delivery. From architecting scalable backend functionalities with .NET Core to designing intuitive, responsive interfaces with ReactJS, my work is dedicated to enhancing user experience and application performance through modular code and comprehensive testing strategies.",
  "experienceOrispotCountry": "Australia, Sydney",
  "experienceOrispotPosition": "Remote",
  "experienceOrispotRole": "Fullstack Developer",

  "experienceParisaShafaqDateFrom": "Apr 2017",
  "experienceParisaShafaqDateTo": "Mar 2022",
  "experienceParisaShafaqDescription": "At Parisa Shafaq, I significantly enhanced my expertise in SQL Server integration, database design, and Windows Forms applications, alongside deepening my understanding of software development fundamentals, teamwork, code optimization, and Git version control, all contributing to my comprehensive skill set in software development and system maintenance.",
  "experienceParisaShafaqCountry": "Iran, Tehran",
  "experienceParisaShafaqPosition": "In-site",
  "experienceParisaShafaqRole": "Windows (WinForms, WPF) and Web Developer",

  "educationWindsorDateFrom": "Sep 2022",
  "educationWindsorDateTo": "Dec 2023",
  "educationWindsorDescription": "During my Master of Applied Computing (MAC), I honed advanced skills in software development, focusing on both theoretical concepts and practical applications. This program equipped me with a deep understanding of computer science principles, including algorithm design, system architecture, and data analysis. I engaged in rigorous projects that emphasized problem-solving in real-world scenarios, leveraging cutting-edge technologies. My studies culminated in a comprehensive project that demonstrated my ability to innovate and apply my knowledge to complex challenges.",
  "educationWindsorCountry": "Canada, Windsor",
  "educationWindsorPosition": "In-Person",
  "educationWindsorRole": "Master of Applied Computing (MAC) - Computer Science",

  "educationAzadUniversityDateFrom": "Sep 2015",
  "educationAzadUniversityDateTo": "Jun 2019",
  "educationAzadUniversityDescription": "In my Bachelor's degree in Software Engineering, I developed a solid foundation in the principles of engineering software systems, from design to implementation. This comprehensive program covered a wide range of topics, including software development life cycles, quality assurance, and database management. Through hands-on projects and collaborative teamwork, I acquired practical experience in developing robust, scalable, and efficient software solutions. My education emphasized not only technical proficiency but also the importance of ethical considerations and effective communication in the field of software engineering.",
  "educationAzadUniversityCountry": "Iran, Tehran",
  "educationAzadUniversityPosition": "In-Person",
  "educationAzadUniversityRole": "Software Engineering",
  
  "contactMeNameLabel": "Name",
  "contactMeEmailLabel": "Email",
  "contactMeSubjectLabel": "Subject",
  "contactMeMessageLabel": "Your Message",

  "contactMeClearButtonLabel": "Name",
  "contactMeSendButtonLabel": "Send",
  "contactMeSendingButtonLabel": "Sending..."
}