{
  "navbarHome": "Startseite",
  "navbarExpertise": "Fachwissen",
  "navbarProjects": "Projekte",
  "navbarExperience": "Erfahrung",
  "navbarEducation": "Bildung",
  "navbarContactMe": "Fähigkeiten",
  
  "titleExpertise": "Fachwissen",
  "titleProjects": "Projekte",
  "titleExperience": "Erfahrung",
  "titleEducation": "Bildung",
  "titleContactMe": "Fähigkeiten",
  
  "expertiseSoftwareDevelopmentTitle": "Softwareentwicklung",
  "expertiseBackendTitle": "Backend",
  "expertiseFrontendTitle": "Frontend",
  "expertiseDatabaseTitle": "Datenbanken",
  "expertiseTitleTechnologies": "Technologien",
  "expertiseDescriptionSoftwareDevelopment": "Erfahren in .NET mit <1>über 6 Jahren</1> Erfahrung in der Entwicklung skalierbarer Lösungen, versiert in <3>OOP</3>, <5>SOLID-Prinzipien</5> und bewährten Programmierpraktiken.",
  "expertiseDescriptionBackend": "Experte in <1>.NET</1> mit einem starken Fokus auf robuste, skalierbare Backends, ergänzt durch Kompetenz in <3>Django</3> und <5>Spring Boot</5>.",
  "expertiseDescriptionFrontend": "Geschickt in <1>React</1>, <3>Next.js</3> und <5>TypeScript</5>, um responsive, benutzerzentrierte Schnittstellen zu erstellen, die nahtlos mit dynamischen Backends integrieren.",
  "expertiseDescriptionDatabase": "Versiert im Umgang mit <1>SQL Server</1>, <3>PostgreSQL</3>, <5>MongoDB</5>, Optimierung der Datenspeicherung und -abfrage für leistungsstarke, skalierbare Anwendungen.",

  "projectTitleCarAuction": "Autoauktion",
  "projectDescriptionCarAuction": "Carsties Auktionen bietet Ihnen eine Online-Plattform für Autoauktionen, realisiert durch eine Mikroservice-Architektur, die das Einstellen, Bieten und Verwalten von Auktionen über eine benutzerfreundliche Schnittstelle ermöglicht.",
  "projectTitleECommerce": "E-Commerce",
  "projectDescriptionECommerce": "Unsere E-Commerce-Anwendung ist eine skalierbare, auf das Backend fokussierte Online-Shopping-Plattform für Produktversteigerungen, gestaltet mit einer klaren Architektur für effiziente Wartung und Nutzung.",
  "projectTitleRideShare": "Fahrgemeinschaft",
  "projectDescriptionRideShare": "Die RideShare-App ist eine vom Backend angetriebene Plattform, die unter Nutzung der SOLID-Prinzipien und einer n-Schichten-Architektur automatisch Fahranwärter mit Fahrern verbindet, einschließlich Zahlungsfunktionen.",
  "projectTitleELearning": "E-Learning",
  "projectDescriptionELearning": "Die Online-Lern-App bietet eine Plattform, auf der Nutzer Pakete erwerben können, um Zugang zu Online-Tutorials und Kursen zu erhalten und nach Abschluss Zertifizierungen zu verdienen.",
  "projectTitleUserActivity": "Nutzeraktivitäten",
  "projectDescriptionUserActivity": "Die Aktivitäten-App ist eine auf .NET Core und React basierende Plattform zum Erstellen, Teilen und Teilnehmen an Aktivitäten, mit Funktionen zur Verwaltung von Nutzerinteraktionen und -beteiligungen.",
  "projectTitleCinemaTicket": " Kinoticket",
  "projectDescriptionCinemaTicket": "Kinoticket ist eine Full-Stack-Webanwendung, die mit React und ASP.NET Core entwickelt wurde, und ermöglicht es den Nutzern, Tickets zu kaufen, während Administratoren Anzeigen und Verkäufe verwalten können.",

  "projectCarAuctionIntro": "Einführung in Carsties Auktionen",
  "projectCarAuctionIntroDescription": "Die Plattform <1>Carsties Auktionen</1> ist ein innovatives Online-Autoauktionssystem, das die Dynamik des Fahrzeughandels verändert. Mit einem Fokus auf die Schaffung eines nahtlosen, effizienten und transparenten Kauf- und Verkaufserlebnisses basiert das Projekt auf einer <3>Microservices-Architektur</3>. Dieser Ansatz nutzt eine Vielzahl fortschrittlicher Technologien und Methodologien, um die Skalierbarkeit, Leistung und Benutzerzufriedenheit der Plattform zu gewährleisten.",
  "projectCarAuctionFeatures": "Kernfunktionen und Benutzererfahrung",
  "projectCarAuctionFeaturesDescription": "Von Grund auf entworfen, zielt Carsties Auktionen darauf ab, den Prozess der Autoauktionen zu optimieren. Benutzer haben die Möglichkeit, Fahrzeuge zu listen, sich in Echtzeit-Geboten zu engagieren und ihre Auktionen mühelos zu verwalten. Wesentliche Merkmale umfassen <1>sichere Benutzerauthentifizierung</1> und -autorisierung, <3>umfassende Auktionsverwaltung</3>, <5>Echtzeit-Gebotsmechanismen</5> und <7>fortgeschrittene Auktionslistungen und -filter</7>. Die Plattform legt auch Wert darauf, die Benutzer mit <9>sofortigen Benachrichtigungen</9> über Auktionsupdates auf dem Laufenden zu halten, um eine engagierte und informierte Gemeinschaft zu fördern.",
  "projectCarAuctionArchitecture": "Architekturübersicht",
  "projectCarAuctionArchitectureDescription": "Die <1>Architektur</1> von Carsties Auktionen ist ein Zeugnis moderner <2>Softwaretechnik</2> und umfasst mehrere <3>Microservices</3>, die jeweils einer spezifischen Funktion gewidmet sind - <4>Auction Service</4>, <5>Bidding Service</5>, <6>Identity Service</6>, <7>Notification Service</7>, <8>Search Service</8> und <9>Gateway Service</9>. Dieses modulare Design verbessert erheblich die <10>Wartbarkeit</10>, <11>Skalierbarkeit</11> der Anwendung und erleichtert <12>agile Entwicklung</12> und <13>Deployment</13>-Prozesse.",
  "projectCarAuctionTechnological": "Technologiestack",
  "projectCarAuctionTechnologicalDescription": "Auf technologischer Front nutzt das Projekt <1>React</1> und <2>Next.js</2>, um ein dynamisches und responsives Frontend-Erlebnis zu schaffen. Die Backend-Architektur wird durch <3>.NET 7</3> angetrieben, mit <4>Entity Framework Core</4> für ORM, <5>MassTransit</5> gekoppelt mit <6>RabbitMQ</6> für effizientes Messaging und <7>gRPC</7> für nahtlose Inter-Service-Kommunikation. Datenspeicherlösungen umfassen <8>PostgreSQL</8> und <9>MongoDB</9>, die sowohl strukturierte als auch Gebotsmanagement-Datenbedürfnisse adressieren. Die gesamte Infrastruktur ist containerisiert unter Verwendung von <10>Docker</10>, wobei <11>Docker Compose</11> die Orchestrierung übernimmt, um Deployment- und Skalierungsoperationen zu vereinfachen.",
  "projectCarAuctionImpact": "Projektauswirkung und persönliche Beiträge",
  "projectCarAuctionImpactDescription": "Dieses Projekt zeigt nicht nur die Anwendung modernster Technologien in realen Szenarien, sondern hebt auch mein umfassendes Können in <1>Architektur</1>, <2>Entwicklung</2> und <3>Deployment</3> komplexer Webanwendungen hervor. Meine Beiträge erstreckten sich über alle Phasen des Projekts - von der anfänglichen Konzeption und <4>Architektur</4> bis hin zur <5>Entwicklung</5> und <6>Deployment</6>, was eine robuste, skalierbare und benutzerzentrierte Plattform gewährleistet. Durch Carsties Auktionen habe ich eine Geschicklichkeit im Navigieren der Komplexitäten der <7>Softwaretechnik</7> demonstriert, die Grenzen traditioneller Webanwendungen erweitert und ein Produkt geliefert, das als Maßstab für Qualität und Innovation im Bereich der Online-Autoauktionen steht.",
  
  
  "experienceCedarValleyDateFrom": "Sep 2023",
  "experienceCedarValleyDateTo": "Jan 2024",
  "experienceCedarValleyDescription": "Bei Cedar Valley leitete ich als Backend-Entwickler die digitale Transformation von manuellen, papierbasierten Prozessen zu ausgefeilten digitalen Systemen. Dabei setzte ich .NET Core und C# ein, um robuste Backend-Systeme zu entwickeln. Meine Beiträge reichen von der Verbesserung der Nachverfolgung von Zutaten und Logistik bis hin zur Implementierung von RabbitMQ für Message Queuing und gelegentlicher Unterstützung des Frontends mit React.js, alles gestützt auf Microsoft SQL Server. Diese Arbeit war entscheidend, um manuelle Arbeit, Fehler zu reduzieren und die betriebliche Effizienz und Verantwortlichkeit zu erhöhen.",
  "experienceCedarValleyCountry": "Kanada, Windsor",
  "experienceCedarValleyPosition": "Vor Ort",
  "experienceCedarValleyRole": "Backend-Entwickler",

  "experienceOrispotDateFrom": "Apr 2023",
  "experienceOrispotDateTo": "Gegenwärtig",
  "experienceOrispotDescription": "In meiner Rolle als Full Stack-Entwickler navigiere ich durch die Komplexitäten der Backend- und Frontend-Entwicklung, wobei ich .NET Core für Backend-Lösungen und ReactJS für die Erstellung ansprechender Benutzeroberflächen nutze. Meine Expertise umfasst objektorientierte Programmierung, objektrelationales Mapping und strenge Testpraktiken, um eine hochwertige Softwareauslieferung zu gewährleisten. Von der Architektur skalierbarer Backend-Funktionalitäten mit .NET Core bis zum Design intuitiver, responsiver Schnittstellen mit ReactJS ist meine Arbeit der Verbesserung der Benutzererfahrung und der Anwendungsleistung durch modularen Code und umfassende Teststrategien gewidmet.",
  "experienceOrispotCountry": "Australien, Sydney",
  "experienceOrispotPosition": "Remote",
  "experienceOrispotRole": "Fullstack-Entwickler",

  "experienceParisaShafaqDateFrom": "Apr 2017",
  "experienceParisaShafaqDateTo": "Mär 2022",
  "experienceParisaShafaqDescription": "Bei Parisa Shafaq konnte ich meine Expertise in der Integration von SQL Server, Datenbankdesign und Windows Forms-Anwendungen erheblich erweitern und gleichzeitig mein Verständnis für die Grundlagen der Softwareentwicklung, Teamarbeit, Codeoptimierung und Git-Versionierung vertiefen, was alles zu meinem umfassenden Fähigkeitsset in der Softwareentwicklung und Systemwartung beitrug.",
  "experienceParisaShafaqCountry": "Iran, Teheran",
  "experienceParisaShafaqPosition": "Vor Ort",
  "experienceParisaShafaqRole": "Windows (WinForms, WPF) und Web-Entwickler",

  "educationWindsorDateFrom": "Sep 2022",
  "educationWindsorDateTo": "Dez 2023",
  "educationWindsorDescription": "Während meines Masterstudiums in Angewandter Informatik (MAC) verfeinerte ich fortgeschrittene Fähigkeiten in der Softwareentwicklung, wobei ich mich sowohl auf theoretische Konzepte als auch auf praktische Anwendungen konzentrierte. Dieses Programm stattete mich mit einem tiefen Verständnis der Prinzipien der Informatik aus, einschließlich Algorithmusdesign, Systemarchitektur und Datenanalyse. Ich nahm an anspruchsvollen Projekten teil, die das Problemlösen in realen Szenarien betonten und modernste Technologien nutzten. Meine Studien gipfelten in einem umfassenden Projekt, das meine Fähigkeit zur Innovation und Anwendung meines Wissens auf komplexe Herausforderungen demonstrierte.",
  "educationWindsorCountry": "Kanada, Windsor",
  "educationWindsorPosition": "Präsenz",
  "educationWindsorRole": "Master of Applied Computing (MAC) - Informatik",

  "educationAzadUniversityDateFrom": "Sep 2015",
  "educationAzadUniversityDateTo": "Jun 2019",
  "educationAzadUniversityDescription": "In meinem Bachelor-Studium der Softwaretechnik entwickelte ich eine solide Grundlage in den Prinzipien des Engineerings von Softwaresystemen, von der Konzeption bis zur Implementierung. Dieses umfassende Programm deckte eine breite Palette von Themen ab, einschließlich Softwareentwicklungslebenszyklen, Qualitätssicherung und Datenbankmanagement. Durch praktische Projekte und Teamarbeit erwarb ich praktische Erfahrungen in der Entwicklung robuster, skalierbarer und effizienter Softwarelösungen. Meine Ausbildung betonte nicht nur technische Kompetenz, sondern auch die Bedeutung ethischer Überlegungen und effektiver Kommunikation im Bereich der Softwaretechnik.",
  "educationAzadUniversityCountry": "Iran, Teheran",
  "educationAzadUniversityPosition": "Präsenz",
  "educationAzadUniversityRole": "Softwaretechnik",

  "contactMeNameLabel": "Name",
  "contactMeEmailLabel": "E-Mail-Adresse",
  "contactMeSubjectLabel": "Betreff",
  "contactMeMessageLabel": "Nachricht",

  "contactMeClearButtonLabel": "Löschen",
  "contactMeSendButtonLabel": "Senden",
  "contactMeSendingButtonLabel": "Senden...",

  "footerSocialDescription": "Wenn Sie an einer Zusammenarbeit an einem Projekt interessiert sind oder meine Expertise benötigen, zögern Sie bitte nicht, über die untenstehenden Kontaktmöglichkeiten Kontakt aufzunehmen.",
  "footerCopyRightYear": "© 2024. Mit Leidenschaft erstellt von <1>Ali Shahbazi</1>.",
  "footerCopyRightText": "Alle Rechte vorbehalten.",

  "footerReferenceMahdiFiroozjaei": "Ali Shahbazi war einer meiner Studenten an der Universität Windsor. Er hat zwei Kurse bei mir absolviert, nämlich Advanced Computing Concept und Internship Project. Ich kenne ihn seit Sep. 2022. Ali hat sich als talentierter Student erwiesen. Ich fand ihn als einen fleißigen Studenten, der durch die Beitragung und Präsentation eines beachtlichen Projekts in der Aktienmarktanalyse auffiel. Ich habe Ali als eine gut organisierte und hart arbeitende Person gefunden und empfehle ihn daher zur Berücksichtigung.",
  "footerReferenceMahdiFiroozjaeiPosition": "Professor",
  "footerReferenceUsamaMir": "Es bereitet mir große Freude, Ali Shahbazi zu empfehlen. Ali war mein Student im Master of Applied Computing (MAC) Programm an der University of Windsor (UoW). Ich fand ihn als einen der besten Studenten in der Klasse. Er ist sehr aufmerksam während seines Unterrichts und stellt relevante Fragen. Er hat gute Noten in meinem Kurs erreicht. Er verfügt über ausgezeichnete schriftliche und mündliche Kommunikationsfähigkeiten, ist extrem organisiert, zuverlässig und computerversiert. Daher empfehle ich Ali nachdrücklich für jegliche Praktika und Jobmöglichkeiten.",
  "footerReferenceUsamaMirPosition": "Professor",
  "footerReferenceAtefehGilvari": "Ali war ein außergewöhnlicher Student in unserem Kurs für fortgeschrittene Softwaretechnik. Seine starken Problemlösungs- und Teamfähigkeiten machen ihn zu einem herausragenden Performer.",
  "footerReferenceAtefehGilvariPosition": "Doktorandin",
  "footerReferenceArashShabbeh": "Ali ist einer der talentiertesten, fleißigsten, schnell lernenden und vertrauenswürdigsten Kollegen, die ich je hatte. Ich glaube, die Zusammenarbeit mit Ali an jedem Projekt könnte zweifellos viele Vorteile haben.",
  "footerReferenceArashShabbehPosition": "Senior .NET-Entwickler"
}