{
  "navbarHome": "Startseite",
  "navbarExpertise": "Fachwissen",
  "navbarProjects": "Projekte",
  "navbarExperience": "Erfahrung",
  "navbarEducation": "Bildung",
  "navbarContactMe": "Fähigkeiten",
  
  "titleExpertise": "Fachwissen",
  "titleProjects": "Projekte",
  "titleExperience": "Erfahrung",
  "titleEducation": "Bildung",
  "titleContactMe": "Fähigkeiten",
  
  "expertiseSoftwareDevelopmentTitle": "Softwareentwicklung",
  "expertiseBackendTitle": "Backend",
  "expertiseFrontendTitle": "Frontend",
  "expertiseDatabaseTitle": "Datenbanken",
  "expertiseTitleTechnologies": "Technologien",
  "expertiseDescriptionSoftwareDevelopment": "Erfahren in .NET mit <1>über 6 Jahren</1> Erfahrung in der Entwicklung skalierbarer Lösungen, versiert in <3>OOP</3>, <5>SOLID-Prinzipien</5> und bewährten Programmierpraktiken.",
  "expertiseDescriptionBackend": "Experte in <1>.NET</1> mit einem starken Fokus auf robuste, skalierbare Backends, ergänzt durch Kompetenz in <3>Django</3> und <5>Spring Boot</5>.",
  "expertiseDescriptionFrontend": "Geschickt in <1>React</1>, <3>Next.js</3> und <5>TypeScript</5>, um responsive, benutzerzentrierte Schnittstellen zu erstellen, die nahtlos mit dynamischen Backends integrieren.",
  "expertiseDescriptionDatabase": "Versiert im Umgang mit <1>SQL Server</1>, <3>PostgreSQL</3>, <5>MongoDB</5>, Optimierung der Datenspeicherung und -abfrage für leistungsstarke, skalierbare Anwendungen.",

  "projectTitleCarAuction": "Autoauktion",
  "projectDescriptionCarAuction": "Carsties Auktionen bietet Ihnen eine Online-Plattform für Autoauktionen, realisiert durch eine Mikroservice-Architektur, die das Einstellen, Bieten und Verwalten von Auktionen über eine benutzerfreundliche Schnittstelle ermöglicht.",
  "projectTitleECommerce": "E-Commerce",
  "projectDescriptionECommerce": "Unsere E-Commerce-Anwendung ist eine skalierbare, auf das Backend fokussierte Online-Shopping-Plattform für Produktversteigerungen, gestaltet mit einer klaren Architektur für effiziente Wartung und Nutzung.",
  "projectTitleRideShare": "Fahrgemeinschaft",
  "projectDescriptionRideShare": "Die RideShare-App ist eine vom Backend angetriebene Plattform, die unter Nutzung der SOLID-Prinzipien und einer n-Schichten-Architektur automatisch Fahranwärter mit Fahrern verbindet, einschließlich Zahlungsfunktionen.",
  "projectTitleELearning": "E-Learning",
  "projectDescriptionELearning": "Die Online-Lern-App bietet eine Plattform, auf der Nutzer Pakete erwerben können, um Zugang zu Online-Tutorials und Kursen zu erhalten und nach Abschluss Zertifizierungen zu verdienen.",
  "projectTitleUserActivity": "Nutzeraktivitäten",
  "projectDescriptionUserActivity": "Die Aktivitäten-App ist eine auf .NET Core und React basierende Plattform zum Erstellen, Teilen und Teilnehmen an Aktivitäten, mit Funktionen zur Verwaltung von Nutzerinteraktionen und -beteiligungen.",
  "projectTitleCinemaTicket": " Kinoticket",
  "projectDescriptionCinemaTicket": "Kinoticket ist eine Full-Stack-Webanwendung, die mit React und ASP.NET Core entwickelt wurde, und ermöglicht es den Nutzern, Tickets zu kaufen, während Administratoren Anzeigen und Verkäufe verwalten können.",

  "projectCarAuctionIntro": "Einführung in Carsties Auktionen",
  "projectCarAuctionIntroDescription": "Die Plattform <1>Carsties Auktionen</1> ist ein innovatives Online-Autoauktionssystem, das die Dynamik des Fahrzeughandels verändert. Mit einem Fokus auf die Schaffung eines nahtlosen, effizienten und transparenten Kauf- und Verkaufserlebnisses basiert das Projekt auf einer <3>Microservices-Architektur</3>. Dieser Ansatz nutzt eine Vielzahl fortschrittlicher Technologien und Methodologien, um die Skalierbarkeit, Leistung und Benutzerzufriedenheit der Plattform zu gewährleisten.",
  "projectCarAuctionFeatures": "Kernfunktionen und Benutzererfahrung",
  "projectCarAuctionFeaturesDescription": "Von Grund auf entworfen, zielt Carsties Auktionen darauf ab, den Prozess der Autoauktionen zu optimieren. Benutzer haben die Möglichkeit, Fahrzeuge zu listen, sich in Echtzeit-Geboten zu engagieren und ihre Auktionen mühelos zu verwalten. Wesentliche Merkmale umfassen <1>sichere Benutzerauthentifizierung</1> und -autorisierung, <3>umfassende Auktionsverwaltung</3>, <5>Echtzeit-Gebotsmechanismen</5> und <7>fortgeschrittene Auktionslistungen und -filter</7>. Die Plattform legt auch Wert darauf, die Benutzer mit <9>sofortigen Benachrichtigungen</9> über Auktionsupdates auf dem Laufenden zu halten, um eine engagierte und informierte Gemeinschaft zu fördern.",
  "projectCarAuctionArchitecture": "Architekturübersicht",
  "projectCarAuctionArchitectureDescription": "Die <1>Architektur</1> von Carsties Auktionen ist ein Zeugnis moderner <2>Softwaretechnik</2> und umfasst mehrere <3>Microservices</3>, die jeweils einer spezifischen Funktion gewidmet sind - <4>Auction Service</4>, <5>Bidding Service</5>, <6>Identity Service</6>, <7>Notification Service</7>, <8>Search Service</8> und <9>Gateway Service</9>. Dieses modulare Design verbessert erheblich die <10>Wartbarkeit</10>, <11>Skalierbarkeit</11> der Anwendung und erleichtert <12>agile Entwicklung</12> und <13>Deployment</13>-Prozesse.",
  "projectCarAuctionTechnological": "Technologiestack",
  "projectCarAuctionTechnologicalDescription": "Auf technologischer Front nutzt das Projekt <1>React</1> und <2>Next.js</2>, um ein dynamisches und responsives Frontend-Erlebnis zu schaffen. Die Backend-Architektur wird durch <3>.NET 7</3> angetrieben, mit <4>Entity Framework Core</4> für ORM, <5>MassTransit</5> gekoppelt mit <6>RabbitMQ</6> für effizientes Messaging und <7>gRPC</7> für nahtlose Inter-Service-Kommunikation. Datenspeicherlösungen umfassen <8>PostgreSQL</8> und <9>MongoDB</9>, die sowohl strukturierte als auch Gebotsmanagement-Datenbedürfnisse adressieren. Die gesamte Infrastruktur ist containerisiert unter Verwendung von <10>Docker</10>, wobei <11>Docker Compose</11> die Orchestrierung übernimmt, um Deployment- und Skalierungsoperationen zu vereinfachen.",
  "projectCarAuctionImpact": "Projektauswirkung und persönliche Beiträge",
  "projectCarAuctionImpactDescription": "Dieses Projekt zeigt nicht nur die Anwendung modernster Technologien in realen Szenarien, sondern hebt auch mein umfassendes Können in <1>Architektur</1>, <2>Entwicklung</2> und <3>Deployment</3> komplexer Webanwendungen hervor. Meine Beiträge erstreckten sich über alle Phasen des Projekts - von der anfänglichen Konzeption und <4>Architektur</4> bis hin zur <5>Entwicklung</5> und <6>Deployment</6>, was eine robuste, skalierbare und benutzerzentrierte Plattform gewährleistet. Durch Carsties Auktionen habe ich eine Geschicklichkeit im Navigieren der Komplexitäten der <7>Softwaretechnik</7> demonstriert, die Grenzen traditioneller Webanwendungen erweitert und ein Produkt geliefert, das als Maßstab für Qualität und Innovation im Bereich der Online-Autoauktionen steht.",
  
  "projectCinemaTicketIntro": "Einführung in Cinema Ticket",
  "projectCinemaTicketIntroDescription": "Das Projekt <1>Cinema Ticket</1> ist eine Full-Stack-Webanwendung, die darauf abzielt, das Kinoerlebnis für Filmbegeisterte zu verbessern. Es ermöglicht den Benutzern, nahtlos Kinotickets für bevorstehende Filme zu durchsuchen und zu kaufen, während Administratoren Vorführzeiten, Filmlisten und Ticketverkäufe effizient verwalten können. Entwickelt mit <2>React</2> für das Frontend und <3>ASP.NET Core</3> für das Backend, gewährleistet die Anwendung eine reaktionsschnelle, skalierbare und sichere Plattform für alle Benutzer.",
  "projectCinemaTicketFeatures": "Kernfunktionen",
  "projectCinemaTicketFeaturesDescription": "Cinema Ticket bietet eine Reihe von Funktionen, einschließlich einer <1>benutzerfreundlichen Oberfläche</1> für eine einfache Navigation, einem <2>umfassenden Filmkatalog</2> mit detaillierten Seiten für jeden Film, <3>Warenkorbfunktionalität</3> für Ticket-Auswahlen und <4>sicherer Benutzerauthentifizierung</4> für die Benutzerverwaltung. Zusätzlich bietet die Plattform <5>Admin-Management-Tools</5> für die Verwaltung von Filmen und Vorführzeiten, was den administrativen Arbeitsablauf insgesamt verbessert.",
  "projectCinemaTicketTechnology": "Technologiestack",
  "projectCinemaTicketTechnologyDescription": "Das Frontend wird mit <1>React</1> unter Verwendung von <2>TypeScript</2> entwickelt und mit <3>Material UI</3> gestaltet. Das Backend wird von <4>ASP.NET Core</4> angetrieben, wobei <5>Entity Framework Core</5> für den Datenzugriff und <6>SQL Server</6> für die Datenbank genutzt wird. <7>Stripe</7> ist für die sichere Zahlungsabwicklung integriert, mit <8>Docker</8> zur Unterstützung der Containerisierung und Bereitstellung, sowie <9>GitHub Actions</9> für CI/CD-Pipelines.",
  "projectCinemaTicketDevelopment": "Entwicklung und Bereitstellung",
  "projectCinemaTicketDevelopmentDescription": "Mit einem Schwerpunkt auf sauberem Code und bewährten Methoden umfasste der Entwicklungsprozess gründliche Tests, um eine fehlerfreie und benutzerfreundliche Plattform zu gewährleisten. Das Design der Anwendung ermöglicht eine einfache Bereitstellung und Skalierbarkeit und spricht ein wachsendes Publikum von Filmbegeisterten an.",
  "projectCinemaTicketPersonalContributions": "Persönliche Beiträge",
  "projectCinemaTicketPersonalContributionsDescription": "Meine Beiträge zum Cinema Ticket-Projekt erstreckten sich über den gesamten Entwicklungszyklus, vom Entwerfen des Datenbankschemas und der Implementierung von Backend-Diensten bis zur Entwicklung des React-Frontends und der Integration der Zahlungsabwicklung. Dieses Projekt verfeinerte meine Fähigkeiten in der Full-Stack-Entwicklung und vertiefte mein Verständnis für die Erstellung skalierbarer, benutzerzentrierter Webanwendungen.",
  
  "projectECommerceIntro": "Einführung in die E-Commerce-Anwendung",
  "projectECommerceIntroDescription": "Die <1>E-Commerce-Anwendung</1> ist eine bahnbrechende E-Commerce-Plattform, spezialisiert auf die Versteigerung von Produkten, entworfen mit einem Fokus auf Effizienz, Skalierbarkeit und Bereitstellung eines ansprechenden Benutzererlebnisses. Diese backend-zentrierte Anwendung dient als Beleg für die effektive Nutzung moderner <3>Softwaretechnik</3>-Prinzipien und bietet sowohl Administratoren als auch Nutzern eine umfassende Palette von Funktionen zur Erleichterung des Auktionsprozesses.",
  "projectECommerceFeatures": "Hauptfunktionen und Benutzererfahrung",
  "projectECommerceFeaturesDescription": "Im Mittelpunkt des Angebots der Plattform stehen ihre <1>Produkt- und Kategorienverwaltungsfunktionen</1>, die es Administratoren ermöglichen, ein aktuelles Inventar zu pflegen. Nutzer profitieren von einem ausgeklügelten <3>Warenkorbsystem</3> und <5>sicherer Zahlungsabwicklung</5>, integriert mit führenden Diensten wie Stripe. Die Anwendung fördert das Engagement durch <7>Echtzeit-Benachrichtigungen</7>, nutzt Twilio für E-Mail- und SMS-Kommunikation und hält die Benutzer über Auktionsupdates und -ergebnisse informiert.",
  "projectECommerceArchitecture": "Architekturübersicht",
  "projectECommerceArchitectureDescription": "Im Kern adoptiert die E-Commerce-Anwendung eine <1>saubere Architektur</1>, die das System in deutlich getrennte Schichten gliedert, um eine Trennung der Anliegen zu gewährleisten und Skalierbarkeit zu erleichtern. Diese Backend-Architektur ist sorgfältig mit <3>.NET Core</3> entwickelt und bietet eine robuste Grundlage für den Bau von RESTful-APIs, die das Rückgrat der Anwendung bilden.",
  "projectECommerceTechnology": "Technologiestack",
  "projectECommerceTechnologyDescription": "Die technologische Stärke der E-Commerce-Anwendung zeigt sich in der Nutzung von <1>SQL Server</1> und <3>Redis</3> für Datenspeicherung und Caching. Diese Wahl gewährleistet hohe Leistung und Zuverlässigkeit. Sicherheit und Benutzerverwaltung werden geschickt durch <5>ASP.NET Identity</5> gehandhabt, während Zahlungstransaktionen sicher mit der <7>Stripe-API</7> verarbeitet werden. Darüber hinaus nutzt die Anwendung <9>Twilio</9> für umfassende Benachrichtigungsdienste und gewährleistet so ein nahtloses und interaktives Benutzererlebnis.",
  "projectECommerceImpact": "Projektauswirkungen und persönliche Beiträge",
  "projectECommerceImpactDescription": "Meine Beteiligung an der E-Commerce-Anwendung erstreckte sich über alle Entwicklungsstufen, von der Konzeptualisierung und dem Design bis zur Implementierung und Bereitstellung. Meine Bemühungen waren entscheidend für die Architektur der Backend-Infrastruktur, die Integration von Zahlungs- und Benachrichtigungsdiensten und die Gewährleistung der Skalierbarkeit und Sicherheit der Anwendung. Dieses Projekt steht als Schaufenster meiner Fähigkeit, <1>moderne Entwicklungspraktiken</1> und <3>Technologiestacks</3> zu nutzen, um eine umfassende und robuste E-Commerce-Lösung zu liefern.",
  
  "projectELearningIntro": "Einführung in E-Learning",
  "projectELearningIntroDescription": "Die <1>E-Learning</1>-Plattform ist eine innovative Online-Bildungsplattform, entwickelt mit dem <3>Django-Framework</3>. Sie dient als virtuelles Klassenzimmer, in dem Lehrkräfte Kurse erstellen und verwalten, Lehrmaterial hochladen und mit den Studierenden interagieren können. Gleichzeitig können Studierende sich in Kurse einschreiben, Lernmaterialien abrufen und ihren Fortschritt verfolgen, was sie zu einer umfassenden Lösung für Fernunterricht macht.",
  "projectELearningFeatures": "Hauptmerkmale und Benutzererfahrung",
  "projectELearningFeaturesDescription": "Im Mittelpunkt der E-Learning-Plattform stehen ihre Kernfunktionen, die darauf abzielen, das Online-Lernen zu verbessern. Dazu gehören <1>dynamische Kursgestaltung und -verwaltung</1> durch Lehrkräfte, <3>Studierendeneinschreibung</3> in Kurse, <5>integrierte Zahlungsabwicklung</5> für Kursgebühren und ein <7>Inhaltslieferungssystem</7>, das verschiedene Dateitypen unterstützt. Darüber hinaus erleichtert die Anwendung <9>interaktive Studierendenbewertungen</9> und Fortschrittsverfolgung, wodurch eine produktive Lernumgebung gefördert wird.",
  "projectELearningTechnology": "Technologischer Stapel",
  "projectELearningTechnologyDescription": "Das Backend der Anwendung wird mit <1>Django</1> entwickelt und nutzt dessen leistungsfähiges ORM für Datenbankinteraktionen sowie sichere Authentifizierungsmechanismen für die Benutzerverwaltung. Das Frontend integriert sich nahtlos in Django-Vorlagen, erweitert mit <3>Bootstrap</3> für ein responsives Design. Für die Datenspeicherung verwendet die App <5>SQLite</5> für die Entwicklung und unterstützt <7>Djongo</7> für die MongoDB-Integration, was Flexibilität im Umgang mit strukturierten und unstrukturierten Daten bietet. Die Zahlungsabwicklung wird über <9>Stripe</9> implementiert, um sichere Transaktionen innerhalb der Plattform zu gewährleisten.",
  "projectELearningDevelopment": "Entwicklung und Einsatz",
  "projectELearningDevelopmentDescription": "Entwicklungspraktiken für E-Learning legten Wert auf Modularität, Sicherheit und Skalierbarkeit. Djangos integrierte Sicherheitsfunktionen wurden rigoros angewandt, um Benutzerdaten und -interaktionen zu schützen. Das Design der Anwendung erleichtert die einfache Bereitstellung und Skalierung und spricht eine wachsende Benutzerbasis an. Umfangreiche Tests wurden durchgeführt, um Zuverlässigkeit und Leistung unter verschiedenen Szenarien zu gewährleisten.",
  "projectELearningPersonalContributions": "Persönliche Beiträge und Lernergebnisse",
  "projectELearningPersonalContributionsDescription": "Meine Rolle bei der Entwicklung von E-Learning erstreckte sich von der Konzeptualisierung bis zur Bereitstellung, einschließlich des Entwurfs des Datenbankschemas, der Implementierung der Backend-Logik und der Gestaltung der Benutzeroberfläche. Dieses Projekt hat meine Fähigkeiten in der Full-Stack-Entwicklung verfeinert, insbesondere in <1>Django</1> und der Sicherheit von Webanwendungen. Es unterstrich die Bedeutung von durchdachtem Design und Tests bei der Erstellung effektiver Bildungswerkzeuge.",
  
  "projectRideShareOverview": "Umfassender Überblick über Revaal",
  "projectRideShareOverviewDescription": "Die Entstehung von <1>Revaal</1> wurde von dem Bestreben angetrieben, die herkömmliche Mitfahrgelegenheitslandschaft neu zu definieren. Dieses Projekt wurde sorgfältig mit <3>.NET Core</3> für das Backend und <5>React</5> für das Frontend entwickelt und verkörpert den Höhepunkt der modernen Webanwendungsentwicklung. Es wurde konzipiert, um den dringenden Bedarf an einer zuverlässigen, effizienten und benutzerzentrierten Plattform zu decken, die den Prozess der gemeinsamen Nutzung von Fahrten vereinfacht, mit einem Schwerpunkt auf Sicherheit, Skalierbarkeit und einem nahtlosen Benutzererlebnis.",
  "projectRideShareFeatures": "Innovatives Funktionsspektrum",
  "projectRideShareFeaturesDescription": "Im Kern von Revaal liegt sein innovatives Funktionsspektrum, das von Grund auf entwickelt wurde, um sowohl Fahrern als auch Fahrgästen gerecht zu werden. Das <1>dynamische Fahrtenvermittlungsalgorithmus</1> des Systems priorisiert nicht nur die geografische Nähe, sondern berücksichtigt auch Benutzerpräferenzen und -bewertungen, um eine sowohl bequeme als auch sichere Übereinstimmung zu gewährleisten. Die Funktion der <3>Echtzeit-Fahrtenverfolgung</3> ermächtigt Benutzer mit Informationen an ihren Fingerspitzen, was Vertrauen und Zuverlässigkeit erhöht. In der Zwischenzeit bietet das <5>integrierte Zahlungssystem</5>, gestärkt durch die robuste Infrastruktur von Stripe, eine breite Palette von Zahlungsoptionen und gewährleistet so reibungslose und sichere Transaktionen.",
  "projectRideShareTechnology": "Technologische Tiefe",
  "projectRideShareTechnologyDescription": "Das architektonische Rückgrat von Revaal ist seine <1>Microservices-Architektur</1>, die eine modulare Entwicklung, einfache Wartung und Skalierbarkeit ermöglicht. Die Abhängigkeit des Backends von <3>ASP.NET Core</3> ist ein Zeugnis unseres Engagements für Leistung und Sicherheit, während die Verwendung von <5>React und TypeScript</5> im Frontend eine dynamische und reaktionsfähige Benutzererfahrung gewährleistet. Unsere Datenbankwahl, <7>SQL Server</7>, zusammen mit <9>MongoDB</9> für dokumentenorientierte Bedürfnisse, spiegelt unser Engagement für robustes Datenmanagement und Flexibilität wider.",
  "projectRideShareSecurity": "Sicherheit und Datenschutz",
  "projectRideShareSecurityDescription": "Sicherheit und Datenschutz stehen als Säulen der Revaal-Plattform. Die Implementierung von <1>JWT</1> für die Authentifizierung und die Einhaltung der <3>OAuth 2.0</3>-Standards für Integrationen von Drittanbietern haben eine sichere Umgebung geschaffen, der Benutzer vertrauen können. Unsere umfassenden Sicherheitsmaßnahmen stellen sicher, dass jede Transaktion und Benutzerinteraktion mit höchster Rücksicht auf Privatsphäre und Datenschutz durchgeführt wird.",
  "projectRideShareChallenges": "Überwindung von Entwicklungsproblemen",
  "projectRideShareChallengesDescription": "Die Entwicklung von Revaal war geprägt von zahlreichen technischen und gestalterischen Herausforderungen. Eine nahtlose Kommunikation zwischen Microservices zu erreichen, erforderte eine ausgeklügelte <1>API-Gateway</1>-Lösung, während die Sicherstellung der Datenkonsistenz über verteilte Dienste innovative Ansätze wie <3>Event Sourcing</3> und <5>CQRS-Muster</5> notwendig machte. Die dynamische Natur des Frontends stellte eigene Herausforderungen dar, die durch fortgeschrittene Zustandsverwaltungstechniken und eine komponentengetriebene Architektur bewältigt wurden.",
  "projectRideShareReflections": "Reflexionen über persönliche Beiträge",
  "projectRideShareReflectionsDescription": "Meine Beteiligung an Revaal erstreckte sich über den gesamten Lebenszyklus, von der konzeptionellen Gestaltung bis zur Bereitstellung. Die Leitung des architektonischen Designs führte mich durch die Komplexitäten der Integration mehrerer Dienste zu einem kohärenten System. Meine Arbeit am Frontend führte innovative Funktionen ein, die die Benutzerinteraktionen verbesserten, während die Backend-Entwicklung sich auf die Erstellung skalierbarer, sicherer Dienste konzentrierte. Dieses Projekt war eine tiefe Lernerfahrung, die meine Expertise in der Full-Stack-Entwicklung vertiefte und die Bedeutung des benutzerzentrierten Designs beim Schaffen wirkungsvoller digitaler Lösungen unterstrich.",
  
  "projectUserActivityIntro": "Einführung in die Aktivitätsanwendung",
  "projectUserActivityIntroDescription": "Die <1>Aktivitätsanwendung</1> entsteht als eine lebendige Community-Plattform, die es Benutzern ermöglicht, eine breite Palette von Aktivitäten zu erstellen, zu teilen und beizutreten. Aufgebaut auf den robusten Grundlagen von <3>.NET Core</3> und <5>React</5>, steht diese Anwendung als Zeugnis moderner Webentwicklungspraktiken und bietet ein ansprechendes und interaktives Benutzererlebnis.",
  "projectUserActivityFeatures": "Kernfunktionen",
  "projectUserActivityFeaturesDescription": "Zu den Schlüsselfunktionen der Aktivitätsanwendung gehören <1>Benutzerauthentifizierung</1>, die sicheres Einloggen und Registrieren ermöglicht; <3>Aktivitätsmanagement</3>, bei dem Benutzer Aktivitäten erstellen, aktualisieren und löschen können; <5>Kommentare</5>, die die Benutzerinteraktion bei Aktivitäten unterstützen; und <7>Bild-Upload</7>, der es Benutzern ermöglicht, zu Aktivitäten gehörende Bilder zu teilen. Die Anwendung nutzt auch <9>SignalR</9> für Echtzeit-Updates, was die Dynamik der Benutzerbeteiligung und -interaktion erhöht.",
  "projectUserActivityTechnology": "Technologiestack",
  "projectUserActivityTechnologyDescription": "Im technologischen Kern wird das Frontend mit <1>React</1> und <3>TypeScript</3> entwickelt und verwendet <5>MobX</5> für das Zustandsmanagement, um eine reaktionsfähige und moderne Benutzeroberfläche zu gewährleisten. Das Backend wird von <7>.NET 5.0</7> angetrieben, mit <9>Entity Framework Core</9> für die Datenbankoperationen und <11>JWT</11> für die Authentifizierung, was eine sichere und skalierbare Anwendungsarchitektur gewährleistet. Für Entwicklungsdatenbanken wird <13>SQLite</13> verwendet, mit Vorkehrungen für eine einfache Migration zu <15>SQL Server</15> oder <17>PostgreSQL</17>. Zusätzlich erleichtert die Integration von <19>Cloudinary</19> robuste Bildhosting-Lösungen.",
  "projectUserActivityDevelopment": "Entwicklungseinblicke",
  "projectUserActivityDevelopmentDescription": "Die Entwicklungsreise der Aktivitätsanwendung legte Wert auf saubere Codierungspraktiken, modulare Architektur und die Implementierung des Echtzeit-Datenaustauschs, um ein lebhaftes Community-Engagement zu fördern. Umfangreiche Testphasen stellten eine fehlerfreie und benutzerfreundliche Plattform sicher, bereit zum Skalieren und Anpassen an die sich entwickelnden Bedürfnisse ihrer Benutzerbasis.",
  "projectUserActivityPersonal": "Persönliche Beiträge",
  "projectUserActivityPersonalDescription": "Meine Rolle in diesem Projekt erstreckte sich von der anfänglichen Konzeptgestaltung über die Entwicklung bis zur endgültigen Bereitstellung. Ich war entscheidend bei der Integration von <1>SignalR</1> für die Echtzeitkommunikation, der Gestaltung der <3>React</3>-Frontend-Komponenten und der Etablierung eines sicheren <5>.NET Core</5>-Backends. Dieses Projekt verfeinerte meine Fähigkeiten in der Full-Stack-Entwicklung, insbesondere bei der Erstellung von Anwendungen, die sofortige Datenaktualisierungen und Benutzerinteraktionen erfordern.",
  

"experienceCedarValleyDateFrom": "Sep 2023",
  "experienceCedarValleyDateTo": "Jan 2024",
  "experienceCedarValleyDescription": "Bei Cedar Valley leitete ich als Backend-Entwickler die digitale Transformation von manuellen, papierbasierten Prozessen zu ausgefeilten digitalen Systemen. Dabei setzte ich .NET Core und C# ein, um robuste Backend-Systeme zu entwickeln. Meine Beiträge reichen von der Verbesserung der Nachverfolgung von Zutaten und Logistik bis hin zur Implementierung von RabbitMQ für Message Queuing und gelegentlicher Unterstützung des Frontends mit React.js, alles gestützt auf Microsoft SQL Server. Diese Arbeit war entscheidend, um manuelle Arbeit, Fehler zu reduzieren und die betriebliche Effizienz und Verantwortlichkeit zu erhöhen.",
  "experienceCedarValleyCountry": "Kanada, Windsor",
  "experienceCedarValleyPosition": "Vor Ort",
  "experienceCedarValleyRole": "Backend-Entwickler",

  "experienceOrispotDateFrom": "Apr 2023",
  "experienceOrispotDateTo": "Gegenwärtig",
  "experienceOrispotDescription": "In meiner Rolle als Full Stack-Entwickler navigiere ich durch die Komplexitäten der Backend- und Frontend-Entwicklung, wobei ich .NET Core für Backend-Lösungen und ReactJS für die Erstellung ansprechender Benutzeroberflächen nutze. Meine Expertise umfasst objektorientierte Programmierung, objektrelationales Mapping und strenge Testpraktiken, um eine hochwertige Softwareauslieferung zu gewährleisten. Von der Architektur skalierbarer Backend-Funktionalitäten mit .NET Core bis zum Design intuitiver, responsiver Schnittstellen mit ReactJS ist meine Arbeit der Verbesserung der Benutzererfahrung und der Anwendungsleistung durch modularen Code und umfassende Teststrategien gewidmet.",
  "experienceOrispotCountry": "Australien, Sydney",
  "experienceOrispotPosition": "Remote",
  "experienceOrispotRole": "Fullstack-Entwickler",

  "experienceParisaShafaqDateFrom": "Apr 2017",
  "experienceParisaShafaqDateTo": "Mär 2022",
  "experienceParisaShafaqDescription": "Bei Parisa Shafaq konnte ich meine Expertise in der Integration von SQL Server, Datenbankdesign und Windows Forms-Anwendungen erheblich erweitern und gleichzeitig mein Verständnis für die Grundlagen der Softwareentwicklung, Teamarbeit, Codeoptimierung und Git-Versionierung vertiefen, was alles zu meinem umfassenden Fähigkeitsset in der Softwareentwicklung und Systemwartung beitrug.",
  "experienceParisaShafaqCountry": "Iran, Teheran",
  "experienceParisaShafaqPosition": "Vor Ort",
  "experienceParisaShafaqRole": "Windows (WinForms, WPF) und Web-Entwickler",

  "educationWindsorDateFrom": "Sep 2022",
  "educationWindsorDateTo": "Dez 2023",
  "educationWindsorDescription": "Während meines Masterstudiums in Angewandter Informatik (MAC) verfeinerte ich fortgeschrittene Fähigkeiten in der Softwareentwicklung, wobei ich mich sowohl auf theoretische Konzepte als auch auf praktische Anwendungen konzentrierte. Dieses Programm stattete mich mit einem tiefen Verständnis der Prinzipien der Informatik aus, einschließlich Algorithmusdesign, Systemarchitektur und Datenanalyse. Ich nahm an anspruchsvollen Projekten teil, die das Problemlösen in realen Szenarien betonten und modernste Technologien nutzten. Meine Studien gipfelten in einem umfassenden Projekt, das meine Fähigkeit zur Innovation und Anwendung meines Wissens auf komplexe Herausforderungen demonstrierte.",
  "educationWindsorCountry": "Kanada, Windsor",
  "educationWindsorPosition": "Präsenz",
  "educationWindsorRole": "Master of Applied Computing (MAC) - Informatik",

  "educationAzadUniversityDateFrom": "Sep 2015",
  "educationAzadUniversityDateTo": "Jun 2019",
  "educationAzadUniversityDescription": "In meinem Bachelor-Studium der Softwaretechnik entwickelte ich eine solide Grundlage in den Prinzipien des Engineerings von Softwaresystemen, von der Konzeption bis zur Implementierung. Dieses umfassende Programm deckte eine breite Palette von Themen ab, einschließlich Softwareentwicklungslebenszyklen, Qualitätssicherung und Datenbankmanagement. Durch praktische Projekte und Teamarbeit erwarb ich praktische Erfahrungen in der Entwicklung robuster, skalierbarer und effizienter Softwarelösungen. Meine Ausbildung betonte nicht nur technische Kompetenz, sondern auch die Bedeutung ethischer Überlegungen und effektiver Kommunikation im Bereich der Softwaretechnik.",
  "educationAzadUniversityCountry": "Iran, Teheran",
  "educationAzadUniversityPosition": "Präsenz",
  "educationAzadUniversityRole": "Softwaretechnik",

  "contactMeNameLabel": "Name",
  "contactMeEmailLabel": "E-Mail-Adresse",
  "contactMeSubjectLabel": "Betreff",
  "contactMeMessageLabel": "Nachricht",

  "contactMeClearButtonLabel": "Löschen",
  "contactMeSendButtonLabel": "Senden",
  "contactMeSendingButtonLabel": "Senden...",

  "footerSocialDescription": "Wenn Sie an einer Zusammenarbeit an einem Projekt interessiert sind oder meine Expertise benötigen, zögern Sie bitte nicht, über die untenstehenden Kontaktmöglichkeiten Kontakt aufzunehmen.",
  "footerCopyRightYear": "© 2024. Mit Leidenschaft erstellt von <1>Ali Shahbazi</1>.",
  "footerCopyRightText": "Alle Rechte vorbehalten.",

  "footerReferenceMahdiFiroozjaei": "Ali Shahbazi war einer meiner Studenten an der Universität Windsor. Er hat zwei Kurse bei mir absolviert, nämlich Advanced Computing Concept und Internship Project. Ich kenne ihn seit Sep. 2022. Ali hat sich als talentierter Student erwiesen. Ich fand ihn als einen fleißigen Studenten, der durch die Beitragung und Präsentation eines beachtlichen Projekts in der Aktienmarktanalyse auffiel. Ich habe Ali als eine gut organisierte und hart arbeitende Person gefunden und empfehle ihn daher zur Berücksichtigung.",
  "footerReferenceMahdiFiroozjaeiPosition": "Professor",
  "footerReferenceUsamaMir": "Es bereitet mir große Freude, Ali Shahbazi zu empfehlen. Ali war mein Student im Master of Applied Computing (MAC) Programm an der University of Windsor (UoW). Ich fand ihn als einen der besten Studenten in der Klasse. Er ist sehr aufmerksam während seines Unterrichts und stellt relevante Fragen. Er hat gute Noten in meinem Kurs erreicht. Er verfügt über ausgezeichnete schriftliche und mündliche Kommunikationsfähigkeiten, ist extrem organisiert, zuverlässig und computerversiert. Daher empfehle ich Ali nachdrücklich für jegliche Praktika und Jobmöglichkeiten.",
  "footerReferenceUsamaMirPosition": "Professor",
  "footerReferenceAtefehGilvari": "Ali war ein außergewöhnlicher Student in unserem Kurs für fortgeschrittene Softwaretechnik. Seine starken Problemlösungs- und Teamfähigkeiten machen ihn zu einem herausragenden Performer.",
  "footerReferenceAtefehGilvariPosition": "Doktorandin",
  "footerReferenceArashShabbeh": "Ali ist einer der talentiertesten, fleißigsten, schnell lernenden und vertrauenswürdigsten Kollegen, die ich je hatte. Ich glaube, die Zusammenarbeit mit Ali an jedem Projekt könnte zweifellos viele Vorteile haben.",
  "footerReferenceArashShabbehPosition": "Senior .NET-Entwickler"
}