{
  "navbarHome": "Accueil",
  "navbarExpertise": "Expertise",
  "navbarProjects": "Projets",
  "navbarExperience": "Expérience",
  "navbarEducation": "Formation",
  "navbarContactMe": "Contactez-moi",

  "titleExpertise": "Expertise",
  "titleProjects": "Projets",
  "titleExperience": "Expérience",
  "titleEducation": "Formation",
  "titleContactMe": "Contactez-moi",

  "expertiseSoftwareDevelopmentTitle": "Développement logiciel",
  "expertiseBackendTitle": "Backend",
  "expertiseFrontendTitle": "Frontend",
  "expertiseDatabaseTitle": "Base de données",
  "expertiseToolsTitle": "Outils",
  "expertiseVersionControlTitle": "Contrôle de version",
  "expertiseSourceCodeTitle": "Code source",
  "expertiseWebsiteTitle": "Site web",
  "expertiseMessageBusTitle": "Bus de messages",
  "expertiseContainerTitle": "Conteneur",
  "expertiseTitleTechnologies": "Technologies",
  "expertiseDescriptionSoftwareDevelopment": "Expérimenté en .NET avec <1>plus de 6 ans</1> de création de solutions évolutives, compétent en <3>POO</3> (Programmation Orientée Objet), <5>principes SOLID</5>, et meilleures pratiques de codage.",
  "expertiseDescriptionBackend": "Expert en <1>.NET</1> avec un accent fort sur des backends robustes et évolutifs, complété par une compétence en <3>Django</3> et <5>Spring Boot</5>.",
  "expertiseDescriptionFrontend": "Compétent en <1>React</1>, <3>Next.js</3>, et <5>TypeScript</5> pour créer des interfaces réactives et centrées sur l'utilisateur qui s'intègrent de manière transparente avec des backends dynamiques.",
  "expertiseDescriptionDatabase": "Qualifié avec <1>SQL Server</1>, <3>PostgreSQL</3>, <5>MongoDB</5>, optimisant le stockage et la récupération des données pour des applications performantes et évolutives.",


  "projectTitleCarAuction": "Vente aux Enchères de Voitures",
  "projectDescriptionCarAuction": "Carsties Auctions offre une plateforme en ligne pour les enchères de voitures avec une architecture de microservices, permettant les annonces, les enchères et la gestion des enchères dans une interface conviviale.",
  "projectTitleECommerce": "E-Commerce",
  "projectDescriptionECommerce": "L'application e-commerce est une plateforme d'achat en ligne évolutive et axée sur le backend pour l'enchère de produits, présentant une architecture propre pour une maintenance efficace.",
  "projectTitleRideShare": "Covoiturage - (Startup)",
  "projectDescriptionRideShare": "L'application RideShare est une plateforme pilotée par le backend, utilisant les principes SOLID et une architecture n-tiers, pour connecter automatiquement les candidats avec les conducteurs, y compris la fonctionnalité de paiement.",
  "projectTitleELearning": "E-Learning",
  "projectDescriptionELearning": "L'application d'apprentissage en ligne offre une plateforme où les utilisateurs peuvent acheter des packages pour accéder et compléter des tutoriels et des cours en ligne, obtenant des certifications à la fin.",
  "projectTitleUserActivity": "Activité des Utilisateurs",
  "projectDescriptionUserActivity": "L'Application d'Activité est une plateforme basée sur .NET Core et React pour créer, partager et rejoindre des activités, présentant la gestion de l'interaction et de la participation des utilisateurs.",
  "projectTitleCinemaTicket": "Billet de Cinéma",
  "projectDescriptionCinemaTicket": "Cinema Ticket est une application web complète utilisant React et ASP.NET Core, permettant aux utilisateurs d'acheter des billets et aux administrateurs de gérer les annonces et les ventes.",

  "projectCarAuctionIntro": "Introduction aux Ventes aux Enchères Carsties",
  "projectCarAuctionIntroDescription": "La plateforme <1>Carsties Auctions</1> est un système innovant de vente aux enchères de voitures en ligne qui transforme la dynamique du commerce de véhicules. Avec un accent sur la création d'une expérience d'achat et de vente fluide, efficace et transparente, le projet est ancré dans une architecture de <3>microservices</3>. Cette approche exploite une variété de technologies et de méthodologies avancées pour assurer la scalabilité, la performance et la satisfaction des utilisateurs de la plateforme.",
  "projectCarAuctionFeatures": "Fonctionnalités Principales et Expérience Utilisateur",
  "projectCarAuctionFeaturesDescription": "Conçues dès le départ, les ventes aux enchères Carsties visent à rationaliser le processus de vente aux enchères de voitures. Les utilisateurs ont la capacité de lister des véhicules, de participer à des enchères en temps réel et de gérer leurs enchères sans effort. Les fonctionnalités essentielles incluent <1>l'authentification sécurisée des utilisateurs</1> et l'autorisation, <3>la gestion complète des enchères</3>, <5>les mécanismes d'enchères en temps réel</5>, et <7>les annonces et filtres d'enchères avancés</7>. La plateforme met également l'accent sur le maintien des utilisateurs informés avec <9>des notifications instantanées</9> sur les mises à jour des enchères, favorisant une communauté engagée et informée.",
  "projectCarAuctionArchitecture": "Aperçu de l'Architecture",
  "projectCarAuctionArchitectureDescription": "L'<1>architecture</1> de Carsties Auctions est un témoignage de l'<2>ingénierie logicielle</2> moderne, comprenant plusieurs <3>microservices</3> dédiés à une fonction spécifique - <4>Service d'Enchères</4>, <5>Service d'Offres</5>, <6>Service d'Identité</6>, <7>Service de Notification</7>, <8>Service de Recherche</8>, et <9>Service de Passerelle</9>. Ce design modulaire améliore significativement la <10>maintenabilité</10> de l'application, sa <11>scalabilité</11scalabilité</11>, et facilite le <12>développement agile</12> et les processus de <13>déploiement</13>.",
  "projectCarAuctionTechnological": "Pile Technologique",
  "projectCarAuctionTechnologicalDescription": "Sur le plan technologique, le projet tire parti de <1>React</1> et de <2>Next.js</2> pour créer une expérience utilisateur dynamique et réactive en frontal. L'architecture backend est alimentée par <3>.NET 7</3>, avec <4>Entity Framework Core</4> pour l'ORM, <5>MassTransit</5> couplé à <6>RabbitMQ</6> pour la messagerie efficace, et <7>gRPC</7> pour la communication inter-services fluide. Les solutions de stockage de données incluent <8>PostgreSQL</8> et <9>MongoDB</9>, répondant aux besoins de gestion des données structurées et des offres. L'ensemble de l'infrastructure est conteneurisé en utilisant <10>Docker</10>, avec <11>Docker Compose</11> pour l'orchestration afin de simplifier le déploiement et les opérations de mise à l'échelle.",
  "projectCarAuctionImpact": "Impact du Projet et Contributions Personnelles",
  "projectCarAuctionImpactDescription": "Ce projet ne se contente pas de montrer l'application de technologies de pointe dans des scénarios du monde réel mais met également en lumière mon ensemble de compétences complet en <1>architecturant</1>, <2>développant</2>, et <3>déployant</3> des applications web complexes. Mes contributions ont couvert toutes les phases du projet - de la conception initiale et de l'<4>architecture</4> au <5>développement</5> et au <6>déploiement</6>, assurant une plateforme robuste, évolutive et centrée sur l'utilisateur. À travers les ventes aux enchères Carsties, j'ai démontré une aptitude à naviguer dans les complexités de l'<7>ingénierie logicielle</7>, repoussant les limites des applications web traditionnelles et livrant un produit qui se présente comme une référence en termes de qualité et d'innovation dans l'espace des enchères de voitures en ligne.",

  "projectCinemaTicketTitle": "Billet de Cinéma",
  "projectCinemaTicketIntro": "Introduction à Billet de Cinéma",
  "projectCinemaTicketIntroDescription": "Le projet <1>Billet de Cinéma</1> est une application web complète conçue pour améliorer l'expérience cinématographique des amateurs de cinéma. Il permet aux utilisateurs de parcourir et d'acheter des billets de cinéma pour les films à venir de manière transparente, tandis que les administrateurs peuvent gérer efficacement les horaires, les listes de films et les ventes de billets. Construit en utilisant <2>React</2> pour le frontend et <3>ASP.NET Core</3> pour le backend, l'application assure une plateforme réactive, évolutive et sécurisée pour tous les utilisateurs.",
  "projectCinemaTicketFeatures": "Fonctionnalités Clés",
  "projectCinemaTicketFeaturesDescription": "Cinema Ticket offre une gamme de fonctionnalités incluant une <1>interface utilisateur conviviale</1> pour une navigation facile, un <2>catalogue complet de films</2> avec des pages détaillées pour chaque film, une <3>fonctionnalité de panier</3> pour les sélections de billets et une <4>authentification utilisateur sécurisée</4> pour la gestion des utilisateurs. De plus, la plateforme propose <5>des outils de gestion administratifs</5> pour la gestion des films et des horaires, améliorant le flux de travail administratif global.",
  "projectCinemaTicketTechnology": "Pile Technologique",
  "projectCinemaTicketTechnologyDescription": "Le frontend est développé avec <1>React</1> en utilisant <2>TypeScript</2>, et stylisé avec <3>Material UI</3>. Le backend est alimenté par <4>ASP.NET Core</4>, utilisant <5>Entity Framework Core</5> pour l'accès aux données et <6>SQL Server</6> pour la base de données. <7>Stripe</7> est intégré pour le traitement sécurisé des paiements, avec <8>Docker</8> soutenant la conteneurisation et le déploiement, et <9>GitHub Actions</9> pour les pipelines CI/CD.",
  "projectCinemaTicketDevelopment": "Développement et Déploiement",
  "projectCinemaTicketDevelopmentDescription": "Mettant l'accent sur le code propre et les meilleures pratiques, le processus de développement incluait des tests approfondis pour assurer une plateforme sans bug et conviviale. La conception de l'application permet un déploiement facile et une évolutivité, répondant à un public croissant d'amateurs de cinéma.",
  "projectCinemaTicketPersonalContributions": "Contributions Personnelles",
  "projectCinemaTicketPersonalContributionsDescription": "Mes contributions au projet Billet de Cinéma ont couvert l'intégralité du cycle de vie du développement, de la conception du schéma de base de données à la mise en œuvre des services backend, en développant le frontend React et en intégrant le traitement des paiements. Ce projet a affiné mes compétences en développement full-stack et approfondi ma compréhension de la création d'applications web évolutives et centrées sur l'utilisateur.",

  "projectECommerceIntro": "Introduction à l'Application E-Commerce",
  "projectECommerceIntroDescription": "L'<1>Application E-Commerce</1> est une plateforme e-commerce révolutionnaire spécialisée dans la mise aux enchères de produits, conçue avec un accent sur l'efficacité, l'évolutivité et la fourniture d'une expérience utilisateur engageante. Cette application centrée sur le backend sert de témoignage à l'utilisation efficace des principes modernes <3>d'ingénierie logicielle</3>, offrant aux administrateurs et aux utilisateurs un ensemble complet de fonctionnalités pour faciliter le processus d'enchère.",
  "projectECommerceFeatures": "Fonctionnalités Clés et Expérience Utilisateur",
  "projectECommerceFeaturesDescription": "Au cœur de l'offre de la plateforme se trouvent ses fonctionnalités <1>de gestion des produits et des catégories</1>, permettant aux administrateurs de maintenir un inventaire à jour. Les utilisateurs bénéficient d'un système de <3>panier d'achat</3> sophistiqué et d'un traitement <5>des paiements sécurisé</5>, intégré avec des services leaders comme Stripe. L'application améliore l'engagement grâce à des <7>notifications en temps réel</7>, utilisant Twilio pour la communication par email et SMS, tenant les utilisateurs informés des mises à jour des enchères et des résultats.",
  "projectECommerceArchitecture": "Aperçu de l'Architecture",
  "projectECommerceArchitectureDescription": "Au cœur de l'Application E-Commerce se trouve une <1>architecture propre</1>, séparant le système en couches distinctes qui garantissent la séparation des préoccupations et facilitent l'évolutivité. Cette architecture backend est méticuleusement conçue en utilisant <3>.NET Core</3>, fournissant une fondation robuste pour la construction d'API RESTful qui servent de colonne vertébrale de l'application.",
  "projectECommerceTechnology": "Pile Technologique",
  "projectECommerceTechnologyDescription": "La prouesse technologique de l'Application E-Commerce est évidente dans son utilisation de <1>SQL Server</1> et de <3>Redis</3> pour le stockage des données et la mise en cache, respectivement. Ce choix garantit des performances élevées et une fiabilité. La sécurité et la gestion des utilisateurs sont habilement gérées grâce à <5>ASP.NET Identity</5>, tandis que les transactions de paiement sont traitées de manière sécurisée avec l'API <7>Stripe</7>. De plus, l'application utilise <9>Twilio</9> pour des services de notification complets, assurant une expérience utilisateur fluide et interactive.",
  "projectECommerceImpact": "Impact du Projet et Contributions Personnelles",
  "projectECommerceImpactDescription": "Mon implication dans l'Application E-Commerce a couvert tous les stades du développement, de la conceptualisation et de la conception à la mise en œuvre et au déploiement. Mes efforts ont été déterminants dans l'architecture de l'infrastructure backend, l'intégration des services de paiement et de notification, et la garantie de l'évolutivité et de la sécurité de l'application. Ce projet se présente comme une vitrine de ma capacité à exploiter les <1>pratiques de développement modernes</1> et les <3>piles technologiques</3> pour livrer une solution e-commerce complète et robuste.",

  "projectRideShareOverview": "Vue d'Ensemble Complète de Revaal",
  "projectRideShareOverviewDescription": "L'initiation de <1>Revaal</1> a été motivée par l'ambition de redéfinir le paysage traditionnel du covoiturage. Ce projet a été méticuleusement élaboré en utilisant <3>.NET Core</3> pour le backend et <5>React</5> pour le frontend, incarnant le summum du développement d'applications web modernes. Il a été conçu pour répondre au besoin criant d'une plateforme fiable, efficace et centrée sur l'utilisateur qui simplifie le processus de partage de trajets, avec un accent sur la sécurité, la scalabilité et une expérience utilisateur sans couture.",
  "projectRideShareFeatures": "Ensemble de Fonctionnalités Innovantes",
  "projectRideShareFeaturesDescription": "Au cœur de Revaal réside son ensemble de fonctionnalités innovantes, conçues de toutes pièces pour répondre aux besoins des conducteurs et des passagers. L'algorithme de jumelage dynamique des trajets du système ne privilégie pas seulement la proximité géographique mais prend également en compte les préférences et les évaluations des utilisateurs, garantissant un jumelage à la fois pratique et sûr. La fonctionnalité de <3>suivi des trajets en temps réel</3> donne aux utilisateurs des informations à portée de main, renforçant la confiance et la fiabilité. Pendant ce temps, le <5>système de paiement intégré</5>, renforcé par l'infrastructure robuste de Stripe, propose un large éventail d'options de paiement, assurant des transactions fluides et sécurisées.",
  "projectRideShareTechnology": "Plongée Profonde dans la Technologie",
  "projectRideShareTechnologyDescription": "L'épine dorsale architecturale de Revaal est son <1>architecture de microservices</1>, permettant un développement modulaire, une facilité de maintenance et une scalabilité. La dépendance du backend sur <3>ASP.NET Core</3> témoigne de notre engagement envers la performance et la sécurité, tandis que l'utilisation du frontend de <5>React et TypeScript</5> assure une expérience utilisateur dynamique et réactive. Notre choix de base de données, <7>SQL Server</7>, aux côtés de <9>MongoDB</9> pour les besoins orientés document, reflète notre dévouement à une gestion des données robuste et flexible.",
  "projectRideShareSecurity": "Aborder la Sécurité et la Confidentialité",
  "projectRideShareSecurityDescription": "La sécurité et la confidentialité constituent les piliers de la plateforme Revaal. En implémentant <1>JWT</1> pour l'authentification et en adhérant aux normes <3>OAuth 2.0</3> pour les intégrations tierces, nous avons établi un environnement sécurisé auquel les utilisateurs peuvent faire confiance. Nos mesures de sécurité complètes garantissent que chaque transaction et interaction utilisateur est menée avec le plus grand égard pour la confidentialité et la protection des données.",
  "projectRideShareChallenges": "Surmonter les Défis de Développement",
  "projectRideShareChallengesDescription": "Le parcours de développement de Revaal a été marqué par de nombreux défis techniques et de conception. Atteindre une communication fluide à travers les microservices a nécessité une solution sophistiquée de <1>passerelle API</1>, tandis que garantir la cohérence des données à travers les services distribués a nécessité des approches innovantes comme le <3>sourcing d'événements</3> et les <5>modèles CQRS</5>. Relever la nature dynamique du frontend a présenté son propre ensemble de défis, relevés grâce à des techniques avancées de gestion d'état et une architecture axée sur les composants.",
  "projectRideShareReflections": "Réflexions sur les Contributions Personnelles",
  "projectRideShareReflectionsDescription": "Mon implication dans Revaal a couvert l'intégralité de son cycle de vie, de la conception conceptuelle au déploiement. Dirigeant la conception architecturale, j'ai navigué à travers les complexités d'intégration de multiples services en un système cohérent. Mon travail sur le frontend a introduit des fonctionnalités innovantes qui ont amélioré les interactions des utilisateurs, tandis que le développement backend s'est concentré sur la création de services évolutifs et sécurisés. Ce projet a été un voyage d'apprentissage profond, approfondissant mon expertise en développement full-stack et renforçant l'importance de la conception centrée sur l'utilisateur dans la création de solutions digitales impactantes.",

  "projectUserActivityIntro": "Introduction à l'Application d'Activité",
  "projectUserActivityIntroDescription": "L'<1>Application d'Activité</1> émerge comme une plateforme communautaire dynamique, permettant aux utilisateurs de créer, partager et rejoindre un large éventail d'activités. Construite sur les fondations robustes de <3>.NET Core</3> et de <5>React</5>, cette application se présente comme un témoignage des pratiques de développement web modernes, offrant une expérience utilisateur engageante et interactive.",
  "projectUserActivityFeatures": "Fonctionnalités Clés",
  "projectUserActivityFeaturesDescription": "Les fonctionnalités clés de l'Application d'Activité incluent <1>l'authentification utilisateur</1>, permettant une connexion et une inscription sécurisées; la <3>gestion des activités</3>, où les utilisateurs peuvent créer, mettre à jour et supprimer des activités; les <5>commentaires</5>, soutenant l'interaction utilisateur sur les activités; et l'<7>envoi d'images</7>, permettant aux utilisateurs de partager des images liées aux activités. L'application tire également parti de <9>SignalR</9> pour les mises à jour en temps réel, améliorant le dynamisme de la participation et de l'interaction des utilisateurs.",
  "projectUserActivityTechnology": "Pile Technologique",
  "projectUserActivityTechnologyDescription": "Au cœur technologique, le frontend est développé avec <1>React</1> et <3>TypeScript</3>, utilisant <5>MobX</5> pour la gestion d'état afin d'assurer une interface utilisateur réactive et à la pointe de la technologie. Le backend est alimenté par <7>.NET 5.0</7>, avec <9>Entity Framework Core</9> gérant les opérations de base de données et <11>JWT</11> pour l'authentification, garantissant une architecture d'application sécurisée et évolutive. <13>SQLite</13> est utilisé pour les bases de données de développement, avec des dispositions pour une migration facile vers <15>SQL Server</15> ou <17>PostgreSQL</17>. De plus, l'intégration de <19>Cloudinary</19> facilite des solutions d'hébergement d'images robustes.",
  "projectUserActivityDevelopment": "Aperçus du Développement",
  "projectUserActivityDevelopmentDescription": "Le parcours de développement de l'Application d'Activité a mis l'accent sur les pratiques de code propre, une architecture modulaire et l'implémentation d'échanges de données en temps réel pour favoriser un engagement communautaire vivant. Des phases de tests rigoureuses ont garanti une plateforme sans bug et conviviale, prête à évoluer et à s'adapter aux besoins changeants de sa base d'utilisateurs.",
  "projectUserActivityPersonal": "Contributions Personnelles",
  "projectUserActivityPersonalDescription": "Mon rôle dans ce projet s'est étendu de la conception conceptuelle initiale, à travers le développement, jusqu'au déploiement final. J'ai joué un rôle clé dans l'intégration de <1>SignalR</1> pour la communication en temps réel, la création des composants frontend <3>React</3>, et l'établissement d'un backend <5>.NET Core</5> sécurisé. Ce projet a affiné mes compétences en développement full-stack, en particulier dans la création d'applications nécessitant des mises à jour de données immédiates et des interactions utilisateur.",

  "projectMahsaDanceIntro": "Introduction à Mahsa Dance",
  "projectMahsaDanceIntroDescription": "Mahsa Dance est une plateforme en ligne spécialisée conçue pour permettre à un professeur de danse de proposer des cours de danse à des étudiants du monde entier. Utilisant des technologies avancées telles que <1>.NET Core</1>, <3>NextJs</3> et <5>SQL Server</5>, la plateforme intègre le commerce électronique avec des outils pédagogiques pour enrichir les expériences des enseignants et des élèves.",
  "projectMahsaDanceFeatures": "Fonctionnalités clés",
  "projectMahsaDanceFeaturesDescription": "Les fonctionnalités principales incluent une <1>section boutique</1> pour sélectionner et acheter des cours, sécurisée par des passerelles de paiement robustes. Un système de livraison vidéo distinctif protège le contenu des cours via un proxy sécurisé, empêchant le partage non autorisé. De plus, des réductions personnalisables et des offres promotionnelles améliorent l'engagement des utilisateurs et les ventes.",
  "projectMahsaDanceTechnology": "Pile technologique",
  "projectMahsaDanceTechnologyDescription": "Le frontend de la plateforme utilise <1>NextJs</1> et <3>TypeScript</3>, stylisé avec <5>Tailwind CSS</5> et <7>SCSS</7> pour une interface utilisateur réactive et moderne. Le backend, alimenté par <9>.NET Core</9> et géré par <11>SQL Server</11>, intègre <13>Cloudflare CDN</13> pour optimiser la livraison de contenu à l'échelle mondiale.",
  "projectMahsaDanceDevelopment": "Sécurité et gestion des données",
  "projectMahsaDanceDevelopmentDescription": "Un mécanisme de proxy et de mise en cache sophistiqué pour le streaming vidéo réduit la redondance et les temps de chargement, améliorant la sécurité du contenu et l'efficacité de la livraison. Les vidéos sont téléchargées de manière sécurisée et mises en cache pour des accès ultérieurs, garantissant un flux de données efficace et sécurisé.",
  "projectMahsaDancePersonal": "Contributions personnelles",
  "projectMahsaDancePersonalDescription": "Tout au long du cycle de vie du projet, j'ai dirigé la conception et la mise en œuvre des fonctionnalités clés, incluant le proxy de streaming vidéo sécurisé, l'intégration de <1>Cloudflare CDN</1>, et le développement du frontend réactif avec <3>NextJs</3> et <5>Tailwind CSS</5>. Ce rôle a affiné mes compétences en développement full-stack et en conception de plateformes sécurisées.",


  "experienceCedarValleyDateFrom": "Sep 2023",
  "experienceCedarValleyDateTo": "Jan 2024",
  "experienceCedarValleyDescription": "Chez Cedar Valley, j'ai dirigé la transformation numérique des processus manuels et basés sur papier en systèmes numériques sophistiqués en tant que Développeur Backend, en exploitant .NET Core et C# pour développer des systèmes backend robustes. Mes contributions vont de l'amélioration du suivi des ingrédients et de la logistique à l'implémentation de RabbitMQ pour la mise en file d'attente des messages et au soutien occasionnel du frontend avec React.js, le tout sous-tendu par Microsoft SQL Server. Ce travail a été crucial pour réduire le travail manuel, les erreurs, et améliorer l'efficacité opérationnelle et la responsabilité.",
  "experienceCedarValleyCountry": "Canada, Windsor",
  "experienceCedarValleyPosition": "Sur site",
  "experienceCedarValleyRole": "Développeur Backend",

  "experienceOrispotDateFrom": "Avr 2023",
  "experienceOrispotDateTo": "Présent",
  "experienceOrispotDescription": "Dans mon rôle de Développeur Full Stack, je navigue dans la complexité du développement backend et frontend, en exploitant .NET Core pour les solutions backend et ReactJS pour créer des interfaces utilisateur engageantes. Mon expertise couvre la Programmation Orientée Objet, le Mapping Objet-Relationnel et des pratiques de test rigoureuses pour garantir une livraison de logiciels de haute qualité. De l'architecture de fonctionnalités backend évolutives avec .NET Core à la conception d'interfaces intuitives et réactives avec ReactJS, mon travail est dédié à améliorer l'expérience utilisateur et la performance de l'application à travers un code modulaire et des stratégies de test complètes.",
  "experienceOrispotCountry": "Australie, Sydney",
  "experienceOrispotPosition": "À distance",
  "experienceOrispotRole": "Développeur Fullstack",

  "experienceParisaShafaqDateFrom": "Avr 2017",
  "experienceParisaShafaqDateTo": "Mar 2022",
  "experienceParisaShafaqDescription": "Chez Parisa Shafaq, j'ai considérablement amélioré mon expertise en intégration de SQL Server, conception de bases de données et applications Windows Forms, tout en approfondissant ma compréhension des fondamentaux du développement logiciel, du travail d'équipe, de l'optimisation du code et du contrôle de version Git, contribuant ainsi à mon ensemble de compétences complet en développement logiciel et maintenance de systèmes.",
  "experienceParisaShafaqCountry": "Iran, Téhéran",
  "experienceParisaShafaqPosition": "Sur site",
  "experienceParisaShafaqRole": "Développeur Windows (WinForms, WPF) et Web",

  "educationWindsorDateFrom": "Sep 2022",
  "educationWindsorDateTo": "Déc 2023",
  "educationWindsorDescription": "Pendant mon Master en Informatique Appliquée (MAC), j'ai affiné des compétences avancées en développement logiciel, en me concentrant à la fois sur les concepts théoriques et les applications pratiques. Ce programme m'a équipé d'une compréhension approfondie des principes de l'informatique, y compris la conception d'algorithmes, l'architecture système et l'analyse de données. J'ai participé à des projets rigoureux qui ont mis l'accent sur la résolution de problèmes dans des scénarios du monde réel, en exploitant des technologies de pointe. Mes études ont abouti à un projet complet qui a démontré ma capacité à innover et à appliquer mes connaissances à des défis complexes.",
  "educationWindsorCountry": "Canada, Windsor",
  "educationWindsorPosition": "En personne",
  "educationWindsorRole": "Master en Informatique Appliquée (MAC) - Informatique",

  "educationAzadUniversityDateFrom": "Sep 2015",
  "educationAzadUniversityDateTo": "Juin 2019",
  "educationAzadUniversityDescription": "Dans mon diplôme de Bachelor en Génie Logiciel, j'ai développé une base solide dans les principes de l'ingénierie des systèmes logiciels, de la conception à la mise en œuvre. Ce programme complet a couvert une large gamme de sujets, y compris les cycles de vie du développement logiciel, l'assurance qualité et la gestion de base de données. À travers des projets pratiques et un travail d'équipe collaboratif, j'ai acquis une expérience pratique dans le développement de solutions logicielles robustes, évolutives et efficaces. Mon éducation a souligné non seulement la compétence technique mais aussi l'importance des considérations éthiques et de la communication efficace dans le domaine du génie logiciel.",
  "educationAzadUniversityCountry": "Iran, Téhéran",
  "educationAzadUniversityPosition": "En personne",
  "educationAzadUniversityRole": "Ingénierie Logicielle",

  "contactMeNameLabel": "Nom",
  "contactMeEmailLabel": "Email",
  "contactMeSubjectLabel": "Sujet",
  "contactMeMessageLabel": "Votre Message",

  "contactMeClearButtonLabel": "Effacer",
  "contactMeSendButtonLabel": "Envoyer",
  "contactMeSendingButtonLabel": "Envoi...",

  "footerSocialDescription": "Si vous êtes intéressé à collaborer sur un projet ou si vous avez besoin de mon expertise, n'hésitez pas à me contacter en utilisant les options de contact ci-dessous.",
  "footerCopyRightYear": "© 2024. Réalisé avec passion par <1>Ali Shahbazi</1>",
  "footerCopyRightText": "Tous droits réservés.",

  "footerReferenceMahdiFiroozjaei": "Ali Shahbazi a été l'un de mes étudiants à l'Université de Windsor. Il a réussi deux cours avec moi, à savoir Concept de Calcul Avancé et Projet de Stage. Je le connais depuis sep. 2022. Ali s'est révélé être un étudiant talentueux. Je l'ai trouvé être un étudiant travailleur en contribuant et en présentant un projet considérable en Analyse du Marché Boursier. J'ai trouvé Ali être une personne bien organisée et travailleuse et je le recommande pour considération.",
  "footerReferenceMahdiFiroozjaeiPosition": "Professeur",
  "footerReferenceUsamaMir": "C'est avec un immense plaisir que je recommande Ali Shahbazi. Ali a été mon étudiant dans le programme de Master en Informatique Appliquée (MAC) à l'Université de Windsor (UoW). Je l'ai trouvé être l'un des meilleurs étudiants de la classe. Il est très attentif pendant ses cours et pose des questions pertinentes. Il a obtenu de bons résultats dans mon cours. Il possède d'excellentes compétences en communication écrite et verbale, est extrêmement organisé, fiable et compétent en informatique. Par conséquent, je recommande fortement Ali pour toute opportunité de stage et d'emploi connexe.",
  "footerReferenceUsamaMirPosition": "Professeur",
  "footerReferenceAtefehGilvari": "Ali était un étudiant exceptionnel dans notre cours avancé de génie logiciel. Ses solides compétences en résolution de problèmes et en travail d'équipe le distinguent.",
  "footerReferenceAtefehGilvariPosition": "Candidate au doctorat",
  "footerReferenceArashShabbeh": "Ali est l'un des collègues les plus talentueux, travailleurs, rapides à apprendre et dignes de confiance que j'ai jamais eu. Je crois que coopérer avec Ali sur n'importe quel projet pourrait sans aucun doute apporter de nombreux avantages.",
  "footerReferenceArashShabbehPosition": "Développeur .NET Senior"
}
